#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x7EA0 (0x8410 - 0x570)
// AnimBlueprintGeneratedClass B_MasterPetAnimBP.B_MasterPetAnimBP_C
class UB_MasterPetAnimBP_C : public UFortPetAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x570(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData            AnimBlueprintClassSubsystem_PropertyAccess;        // 0x578(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_7258[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x580(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x5B0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x638(0x30)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x668(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x688(0x108)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x790(0x88)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_1;                   // 0x818(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x8C8(0xA0)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_168;                // 0x968(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_167;                // 0x990(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_166;                // 0x9B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_165;                // 0x9E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_164;                // 0xA08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_163;                // 0xA30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_162;                // 0xA58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_161;                // 0xA80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_160;                // 0xAA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_159;                // 0xAD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_158;                // 0xAF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_157;                // 0xB20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_156;                // 0xB48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_155;                // 0xB70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_154;                // 0xB98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_153;                // 0xBC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_152;                // 0xBE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_151;                // 0xC10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_150;                // 0xC38(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_149;                // 0xC60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_148;                // 0xC88(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_147;                // 0xCB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_146;                // 0xCD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_145;                // 0xD00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_144;                // 0xD28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_143;                // 0xD50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_142;                // 0xD78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_141;                // 0xDA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_140;                // 0xDC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_139;                // 0xDF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_138;                // 0xE18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_137;                // 0xE40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_136;                // 0xE68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_135;                // 0xE90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_134;                // 0xEB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_133;                // 0xEE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_132;                // 0xF08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_131;                // 0xF30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_130;                // 0xF58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_129;                // 0xF80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_128;                // 0xFA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_127;                // 0xFD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_126;                // 0xFF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_125;                // 0x1020(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_124;                // 0x1048(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_123;                // 0x1070(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_122;                // 0x1098(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_121;                // 0x10C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_120;                // 0x10E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_119;                // 0x1110(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_118;                // 0x1138(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_117;                // 0x1160(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_116;                // 0x1188(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_115;                // 0x11B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_114;                // 0x11D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_113;                // 0x1200(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_112;                // 0x1228(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_111;                // 0x1250(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_110;                // 0x1278(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_109;                // 0x12A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_108;                // 0x12C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_107;                // 0x12F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_106;                // 0x1318(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_105;                // 0x1340(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_104;                // 0x1368(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_103;                // 0x1390(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_102;                // 0x13B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_101;                // 0x13E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_100;                // 0x1408(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99;                 // 0x1430(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_98;                 // 0x1458(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97;                 // 0x1480(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96;                 // 0x14A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95;                 // 0x14D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94;                 // 0x14F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_93;                 // 0x1520(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_92;                 // 0x1548(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91;                 // 0x1570(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_90;                 // 0x1598(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_89;                 // 0x15C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88;                 // 0x15E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87;                 // 0x1610(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_86;                 // 0x1638(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85;                 // 0x1660(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_84;                 // 0x1688(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83;                 // 0x16B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82;                 // 0x16D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_81;                 // 0x1700(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80;                 // 0x1728(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79;                 // 0x1750(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78;                 // 0x1778(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77;                 // 0x17A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76;                 // 0x17C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75;                 // 0x17F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74;                 // 0x1818(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73;                 // 0x1840(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_72;                 // 0x1868(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71;                 // 0x1890(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_70;                 // 0x18B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_69;                 // 0x18E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68;                 // 0x1908(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_67;                 // 0x1930(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66;                 // 0x1958(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65;                 // 0x1980(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_64;                 // 0x19A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63;                 // 0x19D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62;                 // 0x19F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61;                 // 0x1A20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0x1A48(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_90;                   // 0x1A70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_78;                      // 0x1AE8(0x30)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x1B18(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_89;                   // 0x1BB8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_88;                   // 0x1C30(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_13;                    // 0x1CA8(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0x1D70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0x1D98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0x1DC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0x1DE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0x1E10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0x1E38(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_87;                   // 0x1E60(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77;                      // 0x1ED8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_86;                   // 0x1F08(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_76;                      // 0x1F80(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_85;                   // 0x1FB0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_75;                      // 0x2028(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_84;                   // 0x2058(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_74;                      // 0x20D0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_83;                   // 0x2100(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_73;                      // 0x2178(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9;                      // 0x21A8(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_72;                      // 0x2258(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_82;                   // 0x2288(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_71;                      // 0x2300(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_81;                   // 0x2330(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_70;                      // 0x23A8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_80;                   // 0x23D8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_69;                      // 0x2450(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_79;                   // 0x2480(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_78;                   // 0x24F8(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_12;                    // 0x2570(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_68;                      // 0x2638(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0x2668(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77;                   // 0x2690(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_67;                      // 0x2708(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_76;                   // 0x2738(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_66;                      // 0x27B0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_75;                   // 0x27E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_65;                      // 0x2858(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_74;                   // 0x2888(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_64;                      // 0x2900(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x2930(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_73;                   // 0x29F8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_72;                   // 0x2A70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_63;                      // 0x2AE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_71;                   // 0x2B18(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_62;                      // 0x2B90(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0x2BC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0x2BE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0x2C10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0x2C38(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0x2C60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0x2C88(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_70;                   // 0x2CB0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_61;                      // 0x2D28(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_69;                   // 0x2D58(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_60;                      // 0x2DD0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_68;                   // 0x2E00(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0x2E78(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_67;                   // 0x2F40(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_59;                      // 0x2FB8(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0x2FE8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_66;                   // 0x30B0(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_65;                   // 0x3128(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_58;                      // 0x31A0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0x31D0(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_57;                      // 0x3280(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_64;                   // 0x32B0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_56;                      // 0x3328(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_63;                   // 0x3358(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_55;                      // 0x33D0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_62;                   // 0x3400(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_54;                      // 0x3478(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_61;                   // 0x34A8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_53;                      // 0x3520(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0x3550(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x3578(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_60;                   // 0x35A0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_52;                      // 0x3618(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x3648(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x3670(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x3698(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x36C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x36E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x3710(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x3738(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x3760(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x3788(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x37B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x37D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x3800(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_59;                   // 0x3828(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_51;                      // 0x38A0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_58;                   // 0x38D0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_50;                      // 0x3948(0x30)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_49;                      // 0x3978(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x39A8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x39D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x39F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x3A20(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_57;                   // 0x3A48(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_48;                      // 0x3AC0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_56;                   // 0x3AF0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_47;                      // 0x3B68(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55;                   // 0x3B98(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_46;                      // 0x3C10(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x3C40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x3C68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x3C90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x3CB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x3CE0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_54;                   // 0x3D08(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_45;                      // 0x3D80(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_53;                   // 0x3DB0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_44;                      // 0x3E28(0x30)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0x3E58(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_52;                   // 0x3F20(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_51;                   // 0x3F98(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_43;                      // 0x4010(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50;                   // 0x4040(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49;                   // 0x40B8(0x78)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_5;                    // 0x4130(0xA0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x41D0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_48;                   // 0x4298(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47;                   // 0x4310(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_42;                      // 0x4388(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46;                   // 0x43B8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0x4430(0x78)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_4;                    // 0x44A8(0xA0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x4548(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0x4610(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0x4688(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_41;                      // 0x4700(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x4730(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_40;                      // 0x47E0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x4810(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39;                      // 0x48C0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0x48F0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_38;                      // 0x4968(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0x4998(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_37;                      // 0x4A10(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x4A40(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_36;                      // 0x4AF0(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x4B20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x4B48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x4B70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x4B98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x4BC0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0x4BE8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x4C60(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x4C90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x4CB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x4CE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x4D08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x4D30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x4D58(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x4D80(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0x4DF8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x4E28(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0x4EA0(0x30)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x4ED0(0xE0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x4FB0(0xE0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x5090(0xC8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x5158(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x5220(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x5300(0xA0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x53A0(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0x5480(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x54B0(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x5528(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x55F0(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x5668(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x5730(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x5810(0xA0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x58B0(0xE0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x5990(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x59C0(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x5A70(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x5AA0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x5B18(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x5B48(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x5BC0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x5BF0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x5C68(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x5C98(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x5D48(0x30)(None)
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer_1;                      // 0x5D78(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x5DF0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x5E20(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x5E98(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x5EC8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x5F40(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x5F70(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x5FE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x6018(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x6090(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x60C0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x6138(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x6168(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x61E0(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x6210(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x6238(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x6260(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x6288(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x62B0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x6328(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x6358(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x63D0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x6400(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x6478(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x64A8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x6520(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x6550(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x6600(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x6630(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x66A8(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x6720(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_3;                    // 0x67C0(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x6860(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x68D8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x6908(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x6980(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0x69F8(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_2;                    // 0x6A98(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x6B38(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x6BB0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x6BE0(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x6C58(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x6CD0(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1;                    // 0x6D70(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x6E10(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x6E88(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x6EB8(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x6F30(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x6FA8(0xA0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0x7048(0xA0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x70E8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x7160(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x7190(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x7208(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x7280(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x7348(0x30)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x7378(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x73A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x73C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x73F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x7418(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x7440(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x7468(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x7490(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x74B8(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x74E0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x7558(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x7588(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x7600(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x7630(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x76A8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x76D8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x7750(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x7780(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x77F8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x7828(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x78A0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x78D0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x7948(0x30)(None)
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer;                        // 0x7978(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x79F0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x7A20(0xB0)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x7AD0(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x7B00(0xB0)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x7BB0(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x7C78(0x78)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x7CF0(0x78)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x7D68(0x48)(None)
	struct FAnimNode_PoseBlendNode               AnimGraphNode_PoseBlendNode;                       // 0x7DB0(0x98)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x7E48(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x7F10(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x7F38(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x7F60(0xC0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x8020(0xA0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x80C0(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x8188(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x81B0(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x81D8(0xC0)(None)
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0x8298(0x18)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x82B0(0x30)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0x82E0(0xB0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x8390(0x20)(None)
	float                                        HandIKAlphaOverride;                               // 0x83B0(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LegIKAlphaOverride;                                // 0x83B4(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               LookAtTargetLocationInput;                         // 0x83B8(0xC)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LookAtOverrideInput;                               // 0x83C4(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        __CustomProperty_HandIKAlphaOverride_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x83C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        __CustomProperty_LegIKAlphaOverride_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x83CC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               __CustomProperty_LookAtTargetLocationInput_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x83D0(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        __CustomProperty_LookAtOverrideInput_9C794F844BBCD55FAABF0BBB9DC30FB2; // 0x83DC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PlayerLocation;                                    // 0x83E0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasPlayerLocationBeenSet;                         // 0x83EC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsJumpLandComplete_0;                             // 0x83ED(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_725E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        JumpIndex;                                         // 0x83F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DownSightsToLocomotionTimeRemaining_b;             // 0x83F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle;                                        // 0x83F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle2;                                       // 0x83FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HandIKWeight;                                      // 0x8400(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsMovingDuringJumpInitiated;                      // 0x8404(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsFox;                                            // 0x8405(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bAllowSkippingIdleToCrouchTransition;              // 0x8406(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         BlockAnimRule;                                     // 0x8407(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UPoseAsset*                            FacePoseAsset;                                     // 0x8408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UB_MasterPetAnimBP_C* GetDefaultObj();

	void PetSkeletalControlLayer(const struct FPoseLink& Pose, float LookAtOverrideInput, const struct FVector& LookAtTargetLocationInput, float LegIKAlphaOverride, float HandIKAlphaOverride, struct FPoseLink* PetSkeletalControlLayer);
	void PetFullOverrideLayer(const struct FPoseLink& InPose, struct FPoseLink* PetFullOverrideLayer);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void AnimNotify_RollRandomIdle();
	void AnimNotify_RollRandomIdle2();
	void AnimNotify_StartJump_Entered();
	void AnimNotify_StartJump_Entered_Test();
	void AnimNotify_CrouchIdle1_FullyBlended();
	void AnimNotify_CrouchIdle2_FullyBlended();
	void AnimNotify_Entered_Crouching();
