#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1310 (0x1690 - 0x380)
// AnimBlueprintGeneratedClass BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C
class UBadgerBangsLayerAnimBP_C : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x380(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData            AnimBlueprintClassSubsystem_PropertyAccess;        // 0x388(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5AE5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Root                        AnimGraphNode_Root_34;                             // 0x390(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x3C0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_33;                             // 0x448(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x478(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_32;                             // 0x500(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x530(0x88)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x5B8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_31;                             // 0x640(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x670(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_30;                             // 0x6F8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x728(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_29;                             // 0x7A0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x7D0(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_28;                             // 0x848(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x878(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_27;                             // 0x8F0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x920(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_26;                             // 0x998(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0x9C8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_25;                             // 0xA50(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0xA80(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_24;                             // 0xB08(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0xB38(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_23;                             // 0xBC0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_22;                             // 0xBF0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_21;                             // 0xC20(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_20;                             // 0xC50(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_19;                             // 0xC80(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_18;                             // 0xCB0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_17;                             // 0xCE0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_16;                             // 0xD10(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_15;                             // 0xD40(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_14;                             // 0xD70(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_13;                             // 0xDA0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_12;                             // 0xDD0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0xE00(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0xE88(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0xEB8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0xF40(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0xF70(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0xFF8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0x1028(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0x10B0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0x10E0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x1168(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0x1198(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x1220(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x1250(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x12D8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x1308(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x1390(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x13C0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x1448(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x1478(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x1500(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x1530(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x15B8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x15E8(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x1660(0x30)(None)

	static class UClass* StaticClass();
	static class UBadgerBangsLayerAnimBP_C* GetDefaultObj();

	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_BadgerBangsLayerAnimBP(int32 EntryPoint);
};

}


