#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x11F8 (0x1508 - 0x310)
// AnimBlueprintGeneratedClass ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C
class UChargeWeaponLayerAnimBP_C : public UFortItemLayerAnimInstance_ChargedWeapon
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x310(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData            AnimBlueprintClassSubsystem_PropertyAccess;        // 0x318(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6566[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Root                        AnimGraphNode_Root_34;                             // 0x320(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x350(0x88)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x3D8(0x78)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x450(0xC8)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_33;                             // 0x518(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x548(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_32;                             // 0x5D0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x600(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_31;                             // 0x688(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_30;                             // 0x6B8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_29;                             // 0x6E8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_28;                             // 0x718(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_27;                             // 0x748(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_26;                             // 0x778(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_25;                             // 0x7A8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_24;                             // 0x7D8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_23;                             // 0x808(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_22;                             // 0x838(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_21;                             // 0x868(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_20;                             // 0x898(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x8C8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_19;                             // 0x950(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x980(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_18;                             // 0xA08(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0xA38(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_17;                             // 0xAC0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0xAF0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_16;                             // 0xB78(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0xBA8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_15;                             // 0xC30(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0xC60(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_14;                             // 0xCE8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0xD18(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_13;                             // 0xDA0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0xDD0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_12;                             // 0xE58(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0xE88(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0xF10(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0xF40(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0xFC8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0xFF8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0x1080(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0x10B0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x10E0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x1110(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x1140(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x1170(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x11A0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x1228(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x1258(0x88)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x12E0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x1368(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x1398(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x1420(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x1450(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x14D8(0x30)(None)

	static class UClass* StaticClass();
	static class UChargeWeaponLayerAnimBP_C* GetDefaultObj();

	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ChargeWeaponLayerAnimBP(int32 EntryPoint, float K2Node_Event_DeltaTimeX, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, class AFortPlayerPawn* K2Node_DynamicCast_AsFort_Player_Pawn, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue);
};

}


