#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x98 (0x3B8 - 0x320)
// Class FortniteUI.AthenaSpatialScreen
class UAthenaSpatialScreen : public UCommonActivatableWidget
{
public:
	bool                                         bEnableSpatialInputPreprocessing;                  // 0x320(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnableAnalytics;                                  // 0x321(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6A7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          OverrideScreenTag;                                 // 0x324(0x8)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6A8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_Back;                                       // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          ScreenTag;                                         // 0x338(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_CloseMobile;                                // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bNeedsBottomBar;                                   // 0x348(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6A9[0x6F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaSpatialScreen* GetDefaultObj();

	void OnInputSuspensionChanged();
	void FireSpatialScreenAnalytic(const class FString& Interaction);
	void AddSpatialScreenSessionCounter(const class FString& Entry, int32 Count);
};

// 0x40 (0x2C8 - 0x288)
// Class FortniteUI.FortHUDElementWidget
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_6AA[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ElementTag;                                        // 0x290(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                 HUDElementTag;                                     // 0x298(0x20)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class ESlateVisibility                  HiddenVisibility;                                  // 0x2B8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6AB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTutorialHighlight*                    TutorialHighlight;                                 // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortHUDElementWidget* GetDefaultObj();

	void OnVisibilitySetEvent(enum class ESlateVisibility InVisibility);
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer& HiddenHUDElementTags);
};

// 0x28 (0x2F0 - 0x2C8)
// Class FortniteUI.FortMobileHUDElement
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                          SizePropertyTag;                                   // 0x2C8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6AC[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ForcedZOrder;                                      // 0x2E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6AD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UScaleBox*                             ScaleBox_HUDWidgetScale;                           // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortMobileHUDElement* GetDefaultObj();

};

// 0x20 (0x310 - 0x2F0)
// Class FortniteUI.BacchusHUDElement
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	bool                                         bHideWhenNotUsingTouch;                            // 0x2F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUpdatesWithHUDState;                              // 0x2F1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysShow;                                       // 0x2F2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBuildMode;                                     // 0x2F3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCombatMode;                                    // 0x2F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInEditMode;                                      // 0x2F5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInCreativeMode;                                  // 0x2F6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInBattleLabMode;                                 // 0x2F7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsFreeFalling;                                     // 0x2F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              IsGliding;                                         // 0x2F9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              CanOpenChute;                                      // 0x2FA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InLockedBus;                                       // 0x2FB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              InUnlockedBus;                                     // 0x2FC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnTargeting;                                       // 0x2FD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnUsingScopeTargeting;                             // 0x2FE(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanTarget;                                       // 0x2FF(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseScopeTargeting;                            // 0x300(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCrouching;                                       // 0x301(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCanUseSecondaryAbility;                          // 0x302(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDBNO;                                            // 0x303(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingDBNO;                                    // 0x304(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnCarryingHeldObject;                              // 0x305(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnControllingRCPawn;                               // 0x306(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnInVehicle;                                       // 0x307(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnDrivingVehicle;                                  // 0x308(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBacchusHUDStateType              OnZiplining;                                       // 0x309(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6B3[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusHUDElement* GetDefaultObj();

	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(struct FFortHUDState& NewState);
	void HandleInputMethodChanged(enum class ECommonInputType CurrentInputType);
};

// 0x78 (0x388 - 0x310)
// Class FortniteUI.BacchusButton
class UBacchusButton : public UBacchusHUDElement
{
public:
	class UPaperSprite*                          DefaultIcon;                                       // 0x310(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          PressedColor;                                      // 0x318(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          UnpressedColor;                                    // 0x328(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EButtonClickMethod                ClickMethod;                                       // 0x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EButtonTouchMethod                TouchMethod;                                       // 0x339(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6DE[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ButtonSize;                                        // 0x33C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ButtonDisplayScale;                                // 0x340(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         ShowRadialProgress;                                // 0x344(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6DF[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          ListenedGamePlayTag;                               // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Background;                                  // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6E2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USizeBox*                              SizeBox_ButtonSize;                                // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USizeBox*                              SizeBox_ImageSize;                                 // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Icon;                                        // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URadialBacchusButtonBase*              RadialButton_ButtonCooldown;                       // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_InternalButton;                             // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBacchusButton* GetDefaultObj();

	void SetIconPressed(bool bIsPressed);
	void SetDefaultIcon(class UPaperSprite* Icon);
	void SetButtonSprite(class UPaperSprite* NewSprite);
	void SetButtonSize(float NewButtonSize);
	void SetButtonDisplayScale(float NewDisplayScale);
	void OnClicked();
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
};

// 0x48 (0x3D0 - 0x388)
// Class FortniteUI.BacchusActionButton
class UBacchusActionButton : public UBacchusButton
{
public:
	TArray<struct FBacchusActionIconMapping>     ActionMapping;                                     // 0x388(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  TempActionMapping;                                 // 0x398(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                  ItemsAllowingClickThrough;                         // 0x3A0(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCapturesInput;                                    // 0x3B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6ED[0x1F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBacchusActionButton* GetDefaultObj();

	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	void AddActionMappings(const TArray<struct FBacchusActionIconMapping>& NewActionMappings);
};

// 0x78 (0xA0 - 0x28)
// Class FortniteUI.HUDWidgetBehavior
class UHUDWidgetBehavior : public UObject
{
public:
	class FText                                  HUDLayoutToolName;                                 // 0x28(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents;                        // 0x40(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, class FString>     CustomPropertyDefaultOverrides;                    // 0x50(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UHUDWidgetBehavior* GetDefaultObj();

};

// 0x58 (0xF8 - 0xA0)
// Class FortniteUI.FortMobileActionButtonBehavior
class UFortMobileActionButtonBehavior : public UHUDWidgetBehavior
{
public:
	TArray<class FName>                          ActionNames;                                       // 0xA0(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPaperSprite*                          Sprite;                                            // 0xB0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          HUDLayoutToolSaveTag_Legacy;                       // 0xB8(0x8)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F8[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFortMobileButtonBehaviorComponent*> ButtonBehaviorComponents;                          // 0xD0(0x10)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F9[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ForcedZOrder;                                      // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6FA[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortMobileActionButtonBehavior* GetDefaultObj();

};

// 0x50 (0x318 - 0x2C8)
// Class FortniteUI.LTMWidgetBase
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_702[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AFortGameplayMutator>      MutatorClassToWaitFor;                             // 0x308(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_703[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x311(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_704[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ULTMWidgetBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	bool K2_HasActiveContent();
	uint8 GetViewingTeam();
	class AFortPlayerStateAthena* GetViewingPlayerState();
};

// 0x68 (0x330 - 0x2C8)
// Class FortniteUI.FortAthenaVehicleDashboardWidget
class UFortAthenaVehicleDashboardWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_709[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsWidgetShowing;                                  // 0x2D0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_70A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAthenaVehicle*                    CurrentVehicleActor;                               // 0x2D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentSpeed;                                      // 0x2E0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TargetFuelPercent;                                 // 0x2E4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DisplayedFuelPercent;                              // 0x2E8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FillBlendSpeed;                                    // 0x2EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpeedTextMaxInterpolationRate;                     // 0x2F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_70B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 WidgetTagsToHideWhenVisible;                       // 0x2F8(0x20)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        Pad_70C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonNumericTextBlock*               NumericText_Speed;                                 // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        HUDTopSpeed;                                       // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_70D[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortAthenaVehicleDashboardWidget* GetDefaultObj();

	void UpdateSpeedometer(float NormalizedSpeed);
	void ShowNoFuelMessage();
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void SetupVehicleFuelWidget(class AActor* NewVehicle, bool bRequestShowWidget);
	void OnOutOfFuel();
	void OnLowFuel();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnBoostStarted();
	void OnBoostFinished();
	void OnAddedFuel(float NewFuelPercent);
	class AFortAthenaVehicle* GetVehicle();
	float GetHUDTopSpeed();
};

// 0x98 (0x3B8 - 0x320)
// Class FortniteUI.AthenaAboutModal
class UAthenaAboutModal : public UCommonActivatableWidget
{
public:
	FMulticastInlineDelegateProperty_            BP_OnAboutModalClosed;                             // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                  Title;                                             // 0x330(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<class FText>                          Entries;                                           // 0x348(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                HeroImage;                                         // 0x358(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                            ScrollBox_Content;                                 // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_Item;                                        // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Accept;                                     // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_CloseMobile;                                // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_70E[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAboutModal* GetDefaultObj();

	void OnSetContent(class FText& InTitle, TArray<class FText>& InEntries);
	void OnAboutModalClosedDynamic__DelegateSignature();
};

// 0x8 (0x3D8 - 0x3D0)
// Class FortniteUI.AlternativeCarryPickupButton
class UAlternativeCarryPickupButton : public UBacchusActionButton
{
public:
	uint8                                        Pad_70F[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAlternativeCarryPickupButton* GetDefaultObj();

};

// 0x20 (0x480 - 0x460)
// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                     LoadingScreenSlot;                                 // 0x460(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_711[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         Button_Close;                                      // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_CloseMobile;                                // 0x478(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaLoadingScreenPreviewPanelBase* GetDefaultObj();

};

// 0x8 (0x488 - 0x480)
// Class FortniteUI.ApolloIntroLoadingPanel
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                   ApolloIntroPlaylist;                               // 0x480(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UApolloIntroLoadingPanel* GetDefaultObj();

};

// 0x0 (0x260 - 0x260)
// Class FortniteUI.ApolloIntroShimBase
class UApolloIntroShimBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UApolloIntroShimBase* GetDefaultObj();

	void HandleGamePhaseChanged(enum class EAthenaGamePhase GamePhase);
};

// 0x18 (0x330 - 0x318)
// Class FortniteUI.AshtonWidgetBase
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*             AshtonMutatorRef;                                  // 0x318(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_738[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAshtonWidgetBase* GetDefaultObj();

	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int32 NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(enum class EAshtonStoneType StoneType, enum class EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};

// 0x20 (0x50 - 0x30)
// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_            Finished;                                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortPlayerSurveyDispatcher*           Dispatcher;                                        // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_73C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* GetDefaultObj();

	void OnAllSurveysFinishedDelegate__DelegateSignature();
	void HandleAllSurveysFinished(class UObject* Source);
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher, int32 SurveyCount);
};

// 0x20 (0x48 - 0x28)
// Class FortniteUI.AthenaAccoladeWrapper
class UAthenaAccoladeWrapper : public UObject
{
public:
	struct FAthenaAccolades                      AccoladeData;                                      // 0x28(0x20)(NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaAccoladeWrapper* GetDefaultObj();

};

// 0x8 (0x290 - 0x288)
// Class FortniteUI.AthenaAccoladeListEntryWidget
class UAthenaAccoladeListEntryWidget : public UCommonUserWidget
{
public:
	uint8                                        Pad_745[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAccoladeListEntryWidget* GetDefaultObj();

	void SetTitle(class FText& TitleText);
	void SetSource(class FText& SourceText);
	void SetIcon(class UFortAccoladeItemDefinition* ItemDef);
	void SetCount(int32 Count);
};

// 0x0 (0x368 - 0x368)
// Class FortniteUI.AthenaAccoladeListWidget
class UAthenaAccoladeListWidget : public UCommonListView
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccoladeListWidget* GetDefaultObj();

	void PopulateWidget();
};

// 0x80 (0x348 - 0x2C8)
// Class FortniteUI.AthenaAccoladesWidget
class UAthenaAccoladesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_751[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FXPUIEvent>                    XPEvents;                                          // 0x308(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FXPUIEvent                            CurrentEvent;                                      // 0x318(0x28)(Protected, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x340(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_752[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAccoladesWidget* GetDefaultObj();

	void OpenWidget(class UFortAccoladeItemDefinition* AccoladeDef, int32& XpValue, class FText& DisplayName);
	void OnXPEvent(struct FXPUIEvent& XPEvent);
	void OnStompedByOtherWidget();
	bool HasMoreXPEvents();
	void ForwardEvent();
	void EventAdded();
	void CloseWidget();
};

// 0x0 (0x30 - 0x30)
// Class FortniteUI.AthenaAccountContext
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaAccountContext* GetDefaultObj();

	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	class FText GetCurrentSeasonNumberAsText(bool bFullText);
	int32 GetCurrentSeasonNumber();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	class FText GetCurrentChapterNumberAsText(bool bFullText);
	class FText GetCurrentChapterAndSeasonText();
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
};

// 0x8 (0x328 - 0x320)
// Class FortniteUI.AthenaChatModalWrapper
class UAthenaChatModalWrapper : public UCommonActivatableWidget
{
public:
	class UFortChatContainer*                    ChatContainer_Chat;                                // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChatModalWrapper* GetDefaultObj();

};

// 0x20 (0x340 - 0x320)
// Class FortniteUI.AthenaActivatableChatWidget
class UAthenaActivatableChatWidget : public UCommonActivatableWidget
{
public:
	class UAthenaChatModalWrapper*               Activatable_ModalBindings;                         // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_HoldToOpen;                                 // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                            InputActionDataTable;                              // 0x330(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_777[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaActivatableChatWidget* GetDefaultObj();

	void FocusChat(bool bFocus);
	void BacchusFrontendFocusChat();
};

// 0x50 (0x318 - 0x2C8)
// Class FortniteUI.AthenaAerialFeedback
class UAthenaAerialFeedback : public UFortHUDElementWidget
{
public:
	struct FGameplayTagContainer                 GliderRedeployTags;                                // 0x2C8(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          AirbagDeployTag;                                   // 0x2E8(0x8)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemDefinition*                   AirbagItemDefinition;                              // 0x2F0(0x8)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortKeybindWidget*                    KeyBind;                                           // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Feedback;                                     // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_77E[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAerialFeedback* GetDefaultObj();

	void HandleSkydiveLeaderChanged(bool bEnabled, bool bLocal, class AFortPlayerState* LeaderPlayerState);
	void HandleKeybindsChanged();
	void HandleBalloonMovementChanged(bool bUsingBalloonMovement);
	void BP_HandleTextChanged();
};

// 0x18 (0x2E0 - 0x2C8)
// Class FortniteUI.AthenaAIKillsBase
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            KillsText;                                         // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                               KillsSource;                                       // 0x2D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCustomKillSource;                                 // 0x2D8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_782[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaAIKillsBase* GetDefaultObj();

	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};

// 0x8 (0x268 - 0x260)
// Class FortniteUI.AthenaAwardAlertBase
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                PlayerVM;                                          // 0x260(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaAwardAlertBase* GetDefaultObj();

	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};

// 0x8 (0x268 - 0x260)
// Class FortniteUI.AthenaBattleMapClickHandler
class UAthenaBattleMapClickHandler : public UUserWidget
{
public:
	uint8                                        Pad_796[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapClickHandler* GetDefaultObj();

	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
};

// 0x40 (0x2C8 - 0x288)
// Class FortniteUI.AthenaBattleMapNodeTooltip
class UAthenaBattleMapNodeTooltip : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      TextBlock_NodeTitle;                               // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeDescription;                         // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      TextBlock_NodeTime;                                // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Selection;                                  // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_Scrubbing;                                  // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Widget_ScrubbingGamepad;                           // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7A0[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapNodeTooltip* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleUnhoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleInputMethodChanged(enum class ECommonInputType NewInputType);
	void HandleHoveredNode(class ABattleMapNode* Node, enum class EBattleMapHoveredReason Reason);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x38 (0x490 - 0x458)
// Class FortniteUI.FortActivatablePanel
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	uint8                                        Pad_7A7[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsPushedOnToContentPanelStack;                    // 0x460(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlreadyOnContentPanelStack;                     // 0x461(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EInputPriority                    InputPriority;                                     // 0x462(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClosableByPlayerInput;                          // 0x463(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                  PrimaryContentSetup;                               // 0x464(0x1)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_7A9[0x2B];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanel* GetDefaultObj();

	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};

// 0xC0 (0x550 - 0x490)
// Class FortniteUI.AthenaBattleMapTimelineWidget
class UAthenaBattleMapTimelineWidget : public UFortActivatablePanel
{
public:
	class UCommonButton*                         Button_Forward;                                    // 0x490(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Backward;                                   // 0x498(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ForwardButtonPositionAlpha;                        // 0x4A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BackwardButtonPositionAlpha;                       // 0x4A4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ForwardDataTableRow;                               // 0x4A8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   BackwardDataTableRow;                              // 0x4B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   StopDataTableRow;                                  // 0x4C8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ScrubToDataTableRow;                               // 0x4D8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ExitBattleMapDataTableRow;                         // 0x4E8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomInDataTableRow;                                // 0x4F8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ZoomOutDataTableRow;                               // 0x508(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7C4[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattleMapTimelineWidget* GetDefaultObj();

	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleZoomOutPressed(bool* bPassThrough);
	void HandleZoomOutHeld(float HeldPercent);
	void HandleZoomInPressed(bool* bPassThrough);
	void HandleZoomInHeld(float HeldPercent);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineStopPressed(bool* bPassThrough);
	void HandleTimelineScrubToPressed(bool* bPassThrough);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleTimelineForwardPressed(bool* bPassThrough);
	void HandleTimelineBackwardPressed(bool* bPassThrough);
	void HandleSelectedNode(class ABattleMapNode* InSelectedNode);
	void HandleExitBattleMapPressed(bool* bPassThrough);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, enum class ESpectatorCameraType NewCameraType);
};

// 0x10 (0x298 - 0x288)
// Class FortniteUI.AthenaBattlePassItemTracker
class UAthenaBattlePassItemTracker : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_Category;                                     // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonNumericTextBlock*               Text_Counter;                                      // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBattlePassItemTracker* GetDefaultObj();

	void OnInterpStarted();
	void OnInterpEnded(class UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted);
};

// 0xB0 (0x3D0 - 0x320)
// Class FortniteUI.AthenaBattlePassPurchaseScreenSelector
class UAthenaBattlePassPurchaseScreenSelector : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_7E8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UBattlePassPurchaseScreen> BattlePassPurchaseScreenClass;                     // 0x328(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UBattlePassPurchaseScreen> PassSelectionPurchaseScreenClass;                  // 0x350(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattlePassPurchaseScreen*             BattlePassPurchaseScreen;                          // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                          Container_BattlePassPurchaseScreen;                // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_7EA[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          SpatialCamera;                                     // 0x3A0(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                SourceContextNameFallback;                         // 0x3A8(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7EB[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBattlePassPurchaseScreenSelector* GetDefaultObj();

	void RemoveSelfFromWidgetStack();
	void HandlePassPurchaseFlowComplete(bool bClosePresentationScreen);
};

// 0x120 (0x3A8 - 0x288)
// Class FortniteUI.AthenaBattlePassTracker
class UAthenaBattlePassTracker : public UCommonUserWidget
{
public:
	uint8                                        Pad_7EC[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAthenaBattlePassPurchaseScreenSelector> BattlePassPurchaseScreenSelectorClass;             // 0x290(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  OutfitsText;                                       // 0x2B8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  VBucksText;                                        // 0x2D0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  EmotesText;                                        // 0x2E8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  MoreRewardsText;                                   // 0x300(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  BuyBattlePassTextFormat;                           // 0x318(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_7ED[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaBattlePassPurchaseScreenSelector* PushedPurchaseScreenSelector;                      // 0x370(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_PaidItemsCollected;                       // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_01;                          // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_02;                          // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_03;                          // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBattlePassItemTracker*          BattlePassItemTracker_04;                          // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBattlePassScreenPurchaseButton*       Button_PurchaseBattlePass;                         // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBattlePassTracker* GetDefaultObj();

	void HandlePassPurchaseFlowComplete(bool bClosePresentationScreen);
};

// 0x28 (0x2F0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class UAthenaSpectatorPlayerWidgetBase*      PlayerWidget;                                      // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Health;                                // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Shield;                                // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHitPointBarBase*       HitPointBar_Vehicle;                               // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7F7[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastFollowedPlayerInfoBase* GetDefaultObj();

	void OnVehicleStateChanged(class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};

// 0x20 (0x2E8 - 0x2C8)
// Class FortniteUI.AthenaGamePhaseWidgetBase
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                    StormComingFontMaterial;                           // 0x2C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StormComingWarningTime;                            // 0x2D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_7FB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTextBlock*                            TimeText;                                          // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_7FC[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj();

	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseStepChanged(enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
};

// 0x8 (0x2F0 - 0x2E8)
// Class FortniteUI.AthenaBroadcastGamePhaseWidget
class UAthenaBroadcastGamePhaseWidget : public UAthenaGamePhaseWidgetBase
{
public:
	class AFortMinigame*                         MinigameOverride;                                  // 0x2E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastGamePhaseWidget* GetDefaultObj();

	void SetMinigameOverride(class AFortMinigame* Minigame);
};

// 0x18 (0x338 - 0x320)
// Class FortniteUI.FortUIStateWidgetBase
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_802[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonActivatableWidgetStack*         WidgetStack_PrimaryContent;                        // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortUIStateWidgetBase* GetDefaultObj();

};

// 0x190 (0x4C8 - 0x338)
// Class FortniteUI.AthenaHUDBase
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	TArray<class UUserWidget*>                   MinigameWidgets;                                   // 0x338(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_827[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              ScalableOverlay;                                   // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaMapScreenContainer*             MapScreenContainer;                                // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaHUDMenu*                        AthenaHUDMenu;                                     // 0x380(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaPlayerTeamKillsBase*            AthenaTeamKillsWidget;                             // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSquadListBase*                  TeamInfo;                                          // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaPlayerHitPointInfo*             LocalPlayerHitPointInfo;                           // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaEquippedItemBase*               AthenaEquippedItemWidget;                          // 0x3A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSkydivingInformation*           SkydivingInfoWidget;                               // 0x3A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       CompassSwitcher;                                   // 0x3B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URetainerBox*                          RetainerBox_TempFrit;                              // 0x3B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortVolume*                           CreativeLinkedVolume;                              // 0x3C0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaIndicatorLayerBase*             AthenaIndicatorLayer;                              // 0x3C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUserWidget>               KairosHUDLayerClass;                               // 0x3D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMutatorAddedWidgets>          MutatorAddedWidgets;                               // 0x3D8(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInZoneTitleBarBase*                   InZoneTitleBar;                                    // 0x3E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_82A[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FUIExtension>                  TournamentUIExtensions;                            // 0x410(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FUIExtension>                  ArenaTournamentUIExtensions;                       // 0x420(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortWeaponReticleExtensionWidgetBase* CurrentCustomReticleExtension;                     // 0x430(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortWeaponReticleExtensionWidgetBase*> RecentReticleExtensions;                           // 0x438(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_82B[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UCommonActivatableWidget> NewEmotePicker;                                    // 0x450(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UCommonActivatableWidget> SquadComsPickerClass;                              // 0x478(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortWeaponWheel>        WeaponWheelClass;                                  // 0x4A0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaHUDBase* GetDefaultObj();

	void UpdateUIExtensions(class AFortPlayerState* ClientState, class AFortMinigame* Minigame);
	void UpdateCreativePlotLinkedVolume(class AFortVolume* Volume);
	void SetZoneCompleted(bool bValue);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void SetFullscreenMapVisibilityNative(bool bIsVisible);
	void PrepareToShowEndGameUI();
	void PlaylistExtensionWidgetCreatedNotSupported(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnVolumeShowPublishWatermarkChanged(class AFortVolume* Volume, bool bShowPublishWatermark);
	void OnMinigameHideHUD(bool bLoading);
	void OnHUDScaleChanged(float HUDScale);
	void OnGamePhaseChanged(enum class EAthenaGamePhase NewPhase);
	void OnExtensionWidgetRemoved(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnExtensionWidgetCreated(enum class EUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnDisplayGameOver();
	bool HUDOwnsExtensionSlot(enum class EUIExtensionSlot ExtensionSlot);
	void HandleWeaponEquipped(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(enum class EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandlePickerOpenRequest(enum class EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept);
	void HandleOnUpdateInZoneTitleBarVisibility(bool bNewVisibility);
	void HandleOnMutatorRemoved(class AFortGameplayMutator* NewMutator);
	void HandleOnMutatorAdded(class AFortGameplayMutator* NewMutator);
	void HandleNewPanelFromMutator(TSubclassOf<class UUserWidget> PanelClass);
	void HandleLocalPlayerDied(struct FFortPlayerDeathReport& DeathReport);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CustomWidget);
	bool GetZoneCompleted();
	void ClearUIExtensions();
	void BindVolumeEvents();
};

// 0x178 (0x640 - 0x4C8)
// Class FortniteUI.AthenaBroadcastHUDBase
class UAthenaBroadcastHUDBase : public UAthenaHUDBase
{
public:
	struct FDataTableRowHandle                   ToggleMatchStatusActionRowHandle;                  // 0x4C8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleSquadStatusActionRowHandle;                  // 0x4D8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleRemainingPlayersActionRowHandle;             // 0x4E8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActiveGridScreenActionRowHandle;             // 0x4F8(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleEliminatedGridScreenActionRowHandle;         // 0x508(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleMatchStatusScreenActionRowHandle;            // 0x518(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleScoreboardScreenActionRowHandle;             // 0x528(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleKillFeedActionRowHandle;                     // 0x538(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleActionFeedScreenActionRowHandle;             // 0x548(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleGotoTimeRowHandle;                           // 0x558(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   TogglePipModeActionRowHandle;                      // 0x568(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFollowedPlayerInfoActionRowHandle;           // 0x578(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleFullscreenMapActionRowHandle;                // 0x588(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TMap<TSoftClassPtr<class UUserWidget>, struct FUIExtension> ExtensionWidgetOverrides;                          // 0x598(0x50)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorHUDControlsBase*       BroadcastHUDControls;                              // 0x5E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSpectatorNameplateLayerBase*    NameplateLayer;                                    // 0x5F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaBroadcastMapPanelBase*          AthenaBroadcastMapPanel;                           // 0x5F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 EventMatchInfoSwitcher;                            // 0x600(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_TopLeft;                                  // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                               TopLeft_Empty;                                     // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBroadcastViewSettings*            TopLeft_ViewSettings;                              // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaReplayActionFeedScreenBase*     TopLeft_ActionFeed;                                // 0x620(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayGoToTimeDialogue*           TopLeft_GoToTime;                                  // 0x628(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayHighlightsWindow*           TopLeft_Highlights;                                // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_844[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDBase* GetDefaultObj();

	void TryHandleIfPlayerStateAlreadyInVolume();
	void SetFullscreenMapVisibility(bool bIsVisible);
	void OnVolumeMinigameChanged(class AFortMinigame* Minigame);
	void OnVolumeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnVolumeAdded(class AFortVolume* Volume);
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, class FText& FailureText);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleRemainingPlayersActionExecuted(bool* bPassThrough);
	void OnTogglePipModeActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleKillFeedActionExecuted(bool* bPassThrough);
	void OnToggleFollowedPlayerInfoActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnPlaylistDataChanged(class UFortPlaylistAthena* PlaylistData);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnPipModeChanged(bool bEnabled);
	void OnMinigameChanged(class AFortMinigame* NewMinigame);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void OnGameStateSet_BP(class AFortGameStateAthena* GameStateAthena);
	void OnGameStateSet(class AFortGameState* NewGameState);
	void OnCursorModeChanging(bool bCursorModeEnabled, class FName ActionName);
	void OnCurrentPlaylistChanged();
	void HandleToggleReplayViewSettings();
	void HandleToggleHighlightsList();
	void HandleToggleGoToTime();
	void HandleToggleActionFeedScreen();
	void HandleSpectatorViewTargetChanged();
	void HandleNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void HandleHudVisibilityChanged(enum class EHudVisibilityState NewVisibility);
	void HandleFollowedPlayerRespawnTimeChanged(float RespawnTime);
};

// 0x38 (0x300 - 0x2C8)
// Class FortniteUI.FortActorIndicatorWidget
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_848[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                IndicatedActor;                                    // 0x2D0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                   IndicatedActorComponent;                           // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocation;                                  // 0x2E0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxDistance;                                       // 0x2EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bClampOnScreen;                                    // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowClampToScreenArrow;                           // 0x2F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseScreenSpacePosition;                           // 0x2F2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_849[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             ScreenSpaceRelativeOffset;                         // 0x2F4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ScreenPriority;                                    // 0x2FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UFortActorIndicatorWidget* GetDefaultObj();

	void SetIndicatedActor(class AActor* NewIndicatorActor);
	bool IsIndicatingActor(class AActor* OtherActor);
};

// 0x8 (0x308 - 0x300)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                        ZOffset;                                           // 0x300(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_84B[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusBase* GetDefaultObj();

	void MapActivated();
	void InventoryActivated();
};

// 0x10 (0x2D8 - 0x2C8)
// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	TSubclassOf<class UAthenaBroadcastHUDMenuStatusBase> HUDMenuStatusWidgetClass;                          // 0x2C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_84C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastHUDMenuStatusLayerBase* GetDefaultObj();

	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};

// 0x28 (0x2F0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastKillFeedBase
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                  KillFeedEntryBox;                                  // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeToShowEntry;                                   // 0x2D0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_850[0x1C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedBase* GetDefaultObj();

	void OnToggleShowKillFeed(bool bShowKillFeed);
	void OnTimelineScrubbed();
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo& KillFeedEntryInfo);
};

// 0xE8 (0x3B0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastKillFeedItemBase
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_853[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UMaterialInterface>     EliminationIcon;                                   // 0x2D0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     StormIcon;                                         // 0x2F8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     FallDamageIcon;                                    // 0x320(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     ExplosionIcon;                                     // 0x348(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>     DbnoIcon;                                          // 0x370(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_InstigatorName;                               // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_VictimName;                                   // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_EntryIcon;                                   // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastKillFeedItemBase* GetDefaultObj();

};

// 0x40 (0x4D0 - 0x490)
// Class FortniteUI.AthenaBroadcastMapPanelBase
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:
	class UAthenaSpectatorMapPlayerListBase*     PlayerList;                                        // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaMapLayer*                       AthenaMapLayer;                                    // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 LhsSwitcher;                                       // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_CycleSideBar;                               // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CycleSideBarRowHandle;                             // 0x4B0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBroadcasterMapSettings> MapSettingsClass;                                  // 0x4C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_854[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMapPanelBase* GetDefaultObj();

};

// 0x8 (0x2D0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastMatchStatusWidget
class UAthenaBroadcastMatchStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_856[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaBroadcastMatchStatusWidget* GetDefaultObj();

	void OnStormPhaseChanged(int32 StormPhase);
};

// 0x10 (0x2D8 - 0x2C8)
// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
class UAthenaBroadcastPlayerEventScoreWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerEventScoreText;                              // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                 PlayerEventScoreSwitcher;                          // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerEventScoreWidget* GetDefaultObj();

	void OnRemoteClientEventScoreChanged(int32 NewEventScore);
};

// 0x8 (0x2D0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                      PlayerLocationText;                                // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastPlayerLocationWidget* GetDefaultObj();

	void OnRemoteClientPoiTagIDChanged(int16 RemoteClientPoiTagID);
};

// 0x8 (0x2D0 - 0x2C8)
// Class FortniteUI.AthenaBroadcastSessionId
class UAthenaBroadcastSessionId : public UFortHUDElementWidget
{
public:
	class UTextBlock*                            Text_SessionId;                                    // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSessionId* GetDefaultObj();

};

// 0x8 (0x2D0 - 0x2C8)
// Class FortniteUI.AthenaEventMatchSquadWidgetBase
class UAthenaEventMatchSquadWidgetBase : public UFortHUDElementWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData> SquadData;                                         // 0x2C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaEventMatchSquadWidgetBase* GetDefaultObj();

	void SetSquadIdVisible(bool bSquadIdVisible);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int32 InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, const struct FLinearColor& InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
};

// 0x28 (0x2F8 - 0x2D0)
// Class FortniteUI.AthenaBroadcastSquadStatusWidget
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	struct FUniqueNetIdRepl                      FollowedPlayerUID;                                 // 0x2D0(0x28)(BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaBroadcastSquadStatusWidget* GetDefaultObj();

	void OnPipModeChanged(bool bPipModeEnabled);
	void OnMinigameTeamIdChanged(class UFortMinigameTeamIdentification* MinigameTeamId);
	void OnFollowedPlayerChanged();
	void HandleSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, uint8 SquadId);
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};

// 0x78 (0x4D0 - 0x458)
// Class FortniteUI.AthenaCareerScreen
class UAthenaCareerScreen : public UCommonActivatablePanel
{
public:
	TSoftClassPtr<class UAthenaLeaderboardScreenBase> LeaderboardsScreenClass;                           // 0x458(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UAthenaReplayBrowserScreenBase> ReplayBrowserScreenClass;                          // 0x480(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AccountLevel;                                 // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Leaderboards;                               // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Replays;                                    // 0x4B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaFeatTimelineListView*           ListView_FeatTimeline;                             // 0x4C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChapterContext;                               // 0x4C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCareerScreen* GetDefaultObj();

	void ShowFeats(bool bHasCompletedFeats);
};

// 0x1A0 (0x428 - 0x288)
// Class FortniteUI.AthenaCatabaCarousel
class UAthenaCatabaCarousel : public UCommonUserWidget
{
public:
	uint8                                        Pad_88E[0x98];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAthenaCatabaCarouselTile> CarouselTileClass;                                 // 0x320(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Container_CurrentTile;                             // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Container_NextTileToShow;                          // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortClickThroughButton*               MobileClickThroughButton;                          // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          HBox_NavigationButtons;                            // 0x360(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_NextItem;                                     // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PreviousItem;                                 // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_AutoScrollProgress;                          // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Pips;                                     // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                       SwipePanel_ItemsNavigation;                        // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                    ButtonGroup_Pips;                                  // 0x390(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaCatabaCarouselTile*>     Tiles;                                             // 0x398(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          TileSeenTimerHandle;                               // 0x3A8(0x8)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        SelectedItemIndex;                                 // 0x3B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_88F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCatabaCarouselTile*             NextTileToShow;                                    // 0x3B8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCatabaCarouselTile*             CurrentTile;                                       // 0x3C0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_890[0x60];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCatabaCarousel* GetDefaultObj();

	void SelectPrevItem();
	void SelectNextItem();
	void SelectItemAtIndex(int32 ItemIndex);
	void OnTransitionToPreviousTile();
	void OnTransitionToNextTile();
	void OnTransitionCompleted();
	void OnSelectionChanged(bool bInIsSelected);
	void OnIntroAnim();
	int32 GetSelectedIndex();
};

// 0xE8 (0xC88 - 0xBA0)
// Class FortniteUI.AthenaCatabaCarouselTile
class UAthenaCatabaCarouselTile : public UCommonButton
{
public:
	uint8                                        Pad_891[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Title;                                        // 0xBA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Background;                                  // 0xBB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Foreground;                                  // 0xBB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_892[0xB8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            ExternalMedia;                                     // 0xC78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_893[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCatabaCarouselTile* GetDefaultObj();

	void OnPeekStateChanged(bool bIsInPeekState);
	void OnIntro();
	void OnFadeOutTransitionToPrevious();
	void OnFadeOutTransitionToNext();
	void OnFadeInTransitionToPrevious();
	void OnFadeInTransitionToNext();
	void OnActiveStateChanged(bool bIsSelected);
};

// 0x2D8 (0x730 - 0x458)
// Class FortniteUI.AthenaCatabaScreen
class UAthenaCatabaScreen : public UCommonActivatablePanel
{
public:
	uint8                                        Pad_895[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bShowAvailableMTXBalance;                          // 0x468(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FPrimaryContentSetup                  PrimaryContentSetup;                               // 0x469(0x1)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_896[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   OpenMTXStoreAction;                                // 0x470(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FMargin                               SectionsPadding;                                   // 0x480(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextCategoryInputAction;                           // 0x490(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevCategoryInputAction;                           // 0x4A0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortDirectAcquisitionOfferDetailsWidget> OfferInspectScreenClass;                           // 0x4B0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UFortRealMoneyOfferDetails> RMTOfferInspectScreenClass;                        // 0x4D8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UAthenaBattlePassPurchaseScreenSelector> BattlePassPurchaseScreenSelectorClass;             // 0x500(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortAffilateModal>        AffiliateModalClass;                               // 0x528(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortMtxStoreSelectionPopup> StoreSelectionPopupClass;                          // 0x530(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ScrollThreshold;                                   // 0x538(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_897[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortAffilateModal*                    AffiliateModal;                                    // 0x540(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortMtxStoreSelectionPopup*           StoreSelectionPopup;                               // 0x548(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCatabaScrollBox*                  ScrollBox_Sections;                                // 0x550(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          VBox_Sections;                                     // 0x558(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_898[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UInvalidationBox*                      InvalidationBox_ItemShop;                          // 0x578(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Container_AvailableAmount;                         // 0x580(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortShopSectionNavigator*             Navigator_ShopSections;                            // 0x588(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                       SwipePanel_SectionsNavigation;                     // 0x590(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_SectionsPips;                             // 0x598(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTextButton*                       Button_SupportACreator;                            // 0x5A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortTextButton*                       Button_ScrollToTop;                                // 0x5A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_DefaultBackground;                           // 0x5B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                    ButtonGroup_SectionsPips;                          // 0x5B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_899[0x170];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCatabaScreen* GetDefaultObj();

	void OnSectionsEstablished(bool bEmpty);
	void OnEstablishingSections();
	void HandleUserMouseUp(float ScrollAmount);
	void HandlePurchaseOfferComplete(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems);
};

// 0x208 (0x528 - 0x320)
// Class FortniteUI.AthenaCatabaSection
class UAthenaCatabaSection : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_89A[0xCC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OriginalScale;                                     // 0x3EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SmallScale;                                        // 0x3F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A1[0x44];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FString, int32>                   OfferIdToIndexMap;                                 // 0x438(0x50)(Transient, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FIntPoint>        Analytics_OfferIdToIndex2D;                        // 0x488(0x50)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UFortStoreFrontOfferInfo*>      OffersToDisplay;                                   // 0x4D8(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_OfferEntries;                             // 0x4E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCatabaScrollBox*                  ScrollBox_Offers;                                  // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Title;                                        // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                        HBox_Timer;                                        // 0x500(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortEventDateTimeTextBlock*           Text_TimeRemaining;                                // 0x508(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         CircleArrowButton_Next;                            // 0x510(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         CircleArrowButton_Previous;                        // 0x518(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScaleBox*                             ScaleBox_Offers;                                   // 0x520(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCatabaSection* GetDefaultObj();

	void OnSelectedStateUpdated(bool bIsInSelectedState);
	void HandleUserScrolled(float InCurrentScrollOffset);
};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaCatabaSectionInterface
class IAthenaCatabaSectionInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAthenaCatabaSectionInterface* GetDefaultObj();

};

// 0x8 (0xBA8 - 0xBA0)
// Class FortniteUI.FortStoreFrontTileWidgetBase
class UFortStoreFrontTileWidgetBase : public UCommonButton
{
public:
	uint8                                        Pad_8A4[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortStoreFrontTileWidgetBase* GetDefaultObj();

};

// 0x78 (0xC20 - 0xBA8)
// Class FortniteUI.FortStoreFrontOfferWidgetBase
class UFortStoreFrontOfferWidgetBase : public UFortStoreFrontTileWidgetBase
{
public:
	TArray<class UFortStoreFrontOfferInfo*>      GroupedOffers;                                     // 0xBA8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8C3[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLoadGuard*                      MainImageLoadGuard;                                // 0xBC0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8C4[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UFortItemThumbnailRenderer> ThumbnailRendererClass;                            // 0xBF8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortStoreFrontOfferInfo*              OfferData;                                         // 0xC00(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemThumbnailRenderer*            ThumbnailRenderer;                                 // 0xC08(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8C8[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortStoreFrontOfferWidgetBase* GetDefaultObj();

	void UpdateCarousel(float InDeltaTime);
	void SetupThumbnailRenderer(class UFortItemThumbnailRenderer* InThumbnailRenderer);
	void SetupOffer(class UFortStoreFrontOfferInfo* InOfferData);
	void SetStoreRoot(class UFortMtxStoreRootBase* InStoreRoot);
	void SetIndexInSection(int32 InIndexInSection);
	void SendShopInteractionAnalytic(const class FString& Interaction);
	void SendSeasonPassInteractionAnalytic(const class FString& Interaction);
	void SendRealMoneyStoreInteractionAnalytic(const class FString& Interaction);
	void RemoveAllOffers();
	void PreviewNextCarouselOffer();
	void OnUpdateStatus();
	void OnStoreSelectionOfferSet();
	void OnOfferTileBrushLoaded(struct FSlateBrush& OfferBrush);
	void OnOfferSet();
	void OnOfferAdded();
	void OnDetailsOpened(class UFortStoreFrontOfferDetailsWidgetBase* DetailsWidget);
	void HandleCurrentlyViewedAccountInfoChanged(const struct FFortPublicAccountInfo& NewInfo);
	void HandleCarouselOfferChanged();
	class UFortMtxStoreRootBase* GetStoreRoot();
	class UFortStoreFrontOfferInfo* GetOfferInfo();
	TSoftObjectPtr<class UTexture2D> GetFirstOfferSeriesBackgroundTexture();
	TSoftObjectPtr<class UMaterialInterface> GetFirstOfferSeriesBackgroundMaterial();
	void AddOffer(class UFortStoreFrontOfferInfo* InOfferData);
};

// 0x18 (0xC38 - 0xC20)
// Class FortniteUI.AthenaCatabaTile
class UAthenaCatabaTile : public UFortStoreFrontOfferWidgetBase
{
public:
	TSubclassOf<class UFortPurchaseUnavailableModal> PurchaseUnavailableModalClass;                     // 0xC20(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortDirectAcquisitionOfferDetailsWidget> ItemPreviewDetailsClass;                           // 0xC28(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortRealMoneyOfferDetails> RealMoneyDetailsClass;                             // 0xC30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCatabaTile* GetDefaultObj();

};

// 0x120 (0x380 - 0x260)
// Class FortniteUI.AthenaChallengeCountdownDisplay
class UAthenaChallengeCountdownDisplay : public UUserWidget
{
public:
	uint8                                        Pad_8D0[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             UnlockTime;                                        // 0x270(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECountdownDisplay                 DisplayType;                                       // 0x278(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8D1[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerDisplayData                     DisplayData[0x4];                                  // 0x280(0xE0)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8D3[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_TimeRemaining;                                // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeCountdownDisplay* GetDefaultObj();

	void OnChallengeSet(struct FTimerDisplayData& DisplayStyle);
};

// 0x10 (0x298 - 0x288)
// Class FortniteUI.AthenaChallengeDetailBase
class UAthenaChallengeDetailBase : public UCommonUserWidget
{
public:
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailBase* GetDefaultObj();

};

// 0xA0 (0x338 - 0x298)
// Class FortniteUI.AthenaChallengeDetailImageGrid
class UAthenaChallengeDetailImageGrid : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_8DE[0x78];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUniformGridPanel*                     Grid_Image;                                        // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UUserWidget>               EntryWidgetClass;                                  // 0x318(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentFocusedSlot;                                // 0x320(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8E0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        QuestIds;                                          // 0x328(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailImageGrid* GetDefaultObj();

	void OnOwnedToCompleteTransitions(int32 Count, float TimeOffset, float AdditionalTime);
	void OnLockedToOwnedTransitions(int32 Count, float TimeOffset, float AdditionalTime);
};

// 0x20 (0x2B8 - 0x298)
// Class FortniteUI.AthenaChallengeDetailList
class UAthenaChallengeDetailList : public UAthenaChallengeDetailBase
{
public:
	bool                                         bSkipItemDisplay;                                  // 0x298(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuppressItemDisplay;                              // 0x299(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E3[0x16];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeSetListView*           ChallengeListView_SetContents;                     // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailList* GetDefaultObj();

};

// 0x38 (0x2D0 - 0x298)
// Class FortniteUI.AthenaChallengeDetailRewardTrack
class UAthenaChallengeDetailRewardTrack : public UAthenaChallengeDetailBase
{
public:
	uint8                                        Pad_8E6[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumRewardsBeforeScrolling;                         // 0x2A8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowWrapping;                                    // 0x2AC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bScrollingRewards;                                 // 0x2AD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8E7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentBundleLevelBeingViewed;                     // 0x2B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CurrentRewardBeingViewed;                          // 0x2B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                 Switcher_RewardTrack;                              // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Small;                        // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_RewardTrack_Scroll;                       // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeDetailRewardTrack* GetDefaultObj();

	void HandlePreviewItemChanged(int32 RewardIndexToView);
};

// 0x198 (0x1C8 - 0x30)
// Class FortniteUI.AthenaChallengeDisplayData
class UAthenaChallengeDisplayData : public UDataAsset
{
public:
	int32                                        SoonDisplayMinuteThreshold;                        // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          PartyAssistFontColor;                              // 0x34(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DifficultChallengeFontColor;                       // 0x44(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8EA[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            PartyAssistIcon;                                   // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            ExternalPartyAssistIcon;                           // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DefaultChallengeStyle;                             // 0x68(0xA0)(Edit, NativeAccessSpecifierPublic)
	struct FFortChallengeSetStyle                DailyChallengeStyle;                               // 0x108(0xA0)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTagContainer>         PunchCardSortOrder;                                // 0x1A8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortChallengePunchCardStyles> ChallengePunchCardStyles;                          // 0x1B8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class FortniteUI.AthenaChallengeDisplayLibrary
class UAthenaChallengeDisplayLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeDisplayLibrary* GetDefaultObj();

	struct FLinearColor GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle& DisplayStyle);
	void ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UMaterialInstanceDynamic* StyleMaterial);
	void ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle& DisplayStyle, class UImage* ImageWidget);
};

// 0x8 (0x268 - 0x260)
// Class FortniteUI.AthenaChallengeEntry
class UAthenaChallengeEntry : public UUserWidget
{
public:
	class UCommonRichTextBlock*                  Text_CurrentTask;                                  // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeEntry* GetDefaultObj();

};

// 0x18 (0x40 - 0x28)
// Class FortniteUI.ImageGridObject
class UImageGridObject : public UObject
{
public:
	int32                                        GridLocation;                                      // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8EE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortChallengeBundleItemDefinition*    BundleData;                                        // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortQuestItem*                        QuestItem;                                         // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UImageGridObject* GetDefaultObj();

};

// 0x48 (0xBE8 - 0xBA0)
// Class FortniteUI.AthenaChallengeImageGridEntry
class UAthenaChallengeImageGridEntry : public UCommonButton
{
public:
	uint8                                        Pad_8F2[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonLazyImage*                      Image_Brush;                                       // 0xBB8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bSelected;                                         // 0xBC0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8F3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GridLocation;                                      // 0xBC4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Column;                                            // 0xBC8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Row;                                               // 0xBCC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8F4[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeImageGridEntry* GetDefaultObj();

	void TransitionFromOwnedToCompletedState();
	void TransitionFromLockedToOwnedState();
	void SetupLockedToOwnState();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked);
};

// 0x30 (0x2B8 - 0x288)
// Class FortniteUI.AthenaChallengeInfoPanelEntry
class UAthenaChallengeInfoPanelEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_8F5[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_AssistIcon;                                  // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Panel_GroupChallenge;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_AssistTarget;                             // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanelEntry* GetDefaultObj();

	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();
	void HandleQuestsUpdated();
};

// 0x70 (0x2F8 - 0x288)
// Class FortniteUI.AthenaChallengeInfoPanel
class UAthenaChallengeInfoPanel : public UCommonUserWidget
{
public:
	uint8                                        Pad_8F6[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EChallengeInfoPage                CurrentPage;                                       // 0x298(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8F7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   CyclePagesInputAction;                             // 0x2A0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	int32                                        MaxSuggestedEntries;                               // 0x2B0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8F8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x2B8(0x10)(ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8F9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8FA[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeInfoPanel* GetDefaultObj();

	void HandleQuestsUpdatedInGame();
	void HandleNewContextualObjectives(TArray<class UFortQuestItem*>& Objectives);
	void HandleCycleQuestsInputAction(bool* bPassThrough);
};

// 0x88 (0x310 - 0x288)
// Class FortniteUI.AthenaMissionInfoPanel
class UAthenaMissionInfoPanel : public UCommonUserWidget
{
public:
	TSubclassOf<class UAthenaChallengeInfoPanelEntry> FrontendChallengeInfoEntry;                        // 0x288(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAthenaMiniChallengeEntry> MiniChallengeInfoEntry;                            // 0x290(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxSuggestedEntries;                               // 0x298(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bForceToDailyFirst;                                // 0x29C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_91B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class UFortPartyMember>> PartyMembersWithAssistedChallenges;                // 0x2A0(0x10)(ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_91C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  PrestigeShimmerParamName;                          // 0x2B8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ContextColorParamName;                             // 0x2C0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  MissionRewardParamName;                            // 0x2C8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DisplayedChallengeTypes;                      // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeTitle;                               // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ViewNextMission;                            // 0x2F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                TimerImage;                                        // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMissionInfoPanel* GetDefaultObj();

	void SetMissionStyle(const struct FFortChallengeSetStyle& Style);
	void HandleCycleMissionClicked();
};

// 0x40 (0x2C8 - 0x288)
// Class FortniteUI.AthenaInGameChallengeInfoPanel
class UAthenaInGameChallengeInfoPanel : public UCommonUserWidget
{
public:
	int32                                        TotalMaxEntries;                                   // 0x288(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_926[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeInfoPanel*             ChallengeInfo_PartyAssist;                         // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Daily;                               // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Suggested;                           // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Contextual;                          // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeInfoPanel*             ChallengeInfo_Selected;                            // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_NonSelectedChallenges;                       // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_927[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaInGameChallengeInfoPanel* GetDefaultObj();

};

// 0x10 (0x270 - 0x260)
// Class FortniteUI.AthenaChallengeRewardDisplayEntry
class UAthenaChallengeRewardDisplayEntry : public UUserWidget
{
public:
	class UFortLazyImage*                        LazyImage_RewardIcon;                              // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplayEntry* GetDefaultObj();

};

// 0x10 (0x270 - 0x260)
// Class FortniteUI.AthenaChallengeRewardDisplay
class UAthenaChallengeRewardDisplay : public UUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_Rewards;                                  // 0x260(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_CompletionIcon;                              // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardDisplay* GetDefaultObj();

};

// 0x8 (0x290 - 0x288)
// Class FortniteUI.AthenaChallengeListEntryBase
class UAthenaChallengeListEntryBase : public UCommonUserWidget
{
public:
	uint8                                        Pad_92D[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntryBase* GetDefaultObj();

	void StartHighlight();
	void EndHighlight();
};

// 0x28 (0x2B8 - 0x290)
// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
class UAthenaChallengeTreeEntry_ChallengeSet : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_92E[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetContext;                          // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_PercentComplete;                              // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeEntry_ChallengeSet* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x28 (0x2B8 - 0x290)
// Class FortniteUI.AthenaChallengeListEntry_Challenge
class UAthenaChallengeListEntry_Challenge : public UAthenaChallengeListEntryBase
{
public:
	uint8                                        Pad_931[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHideProgressBar;                                  // 0x2A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_933[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_ChallengeDesc;                            // 0x2A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Challenge* GetDefaultObj();

	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bIsGroupChallenge, bool bCompact, bool HideRewards);
	int32 GetChallengeWeight();
	void BP_HandleIsTrackedChallengeChanged(bool bIsTrackedChallenge);
};

// 0x68 (0x320 - 0x2B8)
// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
class UAthenaChallengeListEntry_DetailedChallenge : public UAthenaChallengeListEntry_Challenge
{
public:
	uint8                                        Pad_937[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasAnyOptionsAvailable;                           // 0x2C8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDisplayingChallengeActions;                     // 0x2C9(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_939[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BackAction;                                        // 0x2D0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CloseChallengeOptionsAction;                       // 0x2E0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_ShowChallengeOptions;                    // 0x2F0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_TopClickArea;                         // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplay*         Reward_QuestReward;                                // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PartyAssist;                                // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ReplaceChallenge;                           // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ActionInfo;                               // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_DetailedChallenge* GetDefaultObj();

	void HandleUpperAreaClicked();
	void HandleCloseChallengeOptionsInputAction(bool* bPassThrough);
};

// 0x8 (0x298 - 0x290)
// Class FortniteUI.AthenaChallengeListEntry_Header
class UAthenaChallengeListEntry_Header : public UAthenaChallengeListEntryBase
{
public:
	class UCommonTextBlock*                      Text_SectionTitle;                                 // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_Header* GetDefaultObj();

	void OnSectionTypeSet(enum class EChallengeListSection SectionType);
};

// 0x18 (0x2A8 - 0x290)
// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
class UAthenaChallengeListEntry_CompletionReward : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeRewardDisplay*         Reward_CompletionReward;                           // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_CompletionReward* GetDefaultObj();

	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle& DisplayStyle);
};

// 0x48 (0x2D8 - 0x290)
// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
class UAthenaChallengeListEntry_StoreOffer : public UAthenaChallengeListEntryBase
{
public:
	TSoftClassPtr<class UFortStoreFrontOfferDetailsWidgetBase> OfferDetailsWidgetClass;                           // 0x290(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x2B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               SimpleButton_ClickArea;                            // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        LazyImage_SpecialOffer;                            // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeListEntry_StoreOffer* GetDefaultObj();

	void OnOfferSet();
	void HandleClicked();
};

// 0xE8 (0x300 - 0x218)
// Class FortniteUI.AthenaChallengeListViewBase
class UAthenaChallengeListViewBase : public UListViewBase
{
public:
	uint8                                        Pad_93B[0xE0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_93C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeListViewBase* GetDefaultObj();

};

// 0x68 (0x2F0 - 0x288)
// Class FortniteUI.AthenaChallengePage
class UAthenaChallengePage : public UCommonUserWidget
{
public:
	class UDynamicEntryBox*                      EntryBox_Challenges;                               // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_93E[0x60];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengePage* GetDefaultObj();

	void HandleDisplayDynamicQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate);
};

// 0x68 (0xC60 - 0xBF8)
// Class FortniteUI.AthenaChallengePageRotator
class UAthenaChallengePageRotator : public UCommonRotator
{
public:
	class UCommonButton*                         Button_Next;                                       // 0xBF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_Previous;                                   // 0xC00(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   PrimaryNextInput;                                  // 0xC08(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   PrimaryPreviousInput;                              // 0xC18(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SecondaryNextInput;                                // 0xC28(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   SecondaryPreviousInput;                            // 0xC38(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_942[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengePageRotator* GetDefaultObj();

	void SetInputBindingVisiblity(enum class ESlateVisibility InVisibility);
	void OnNumPagesSet(int32 NumPages);
};

// 0x90 (0x3B0 - 0x320)
// Class FortniteUI.AthenaChallengePageView
class UAthenaChallengePageView : public UCommonActivatableWidget
{
public:
	bool                                         bInGame;                                           // 0x320(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_948[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengePage>      PageEntryClass;                                    // 0x328(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MaxNumEntriesPerPage;                              // 0x330(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_949[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  PageNumberTextFormat;                              // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UAthenaChallengePage*                  ChallengePage;                                     // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_PageNumber;                               // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAthenaChallengePageState         PageState;                                         // 0x360(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_94B[0x4F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengePageView* GetDefaultObj();

	void OnPageCycledOut();
	void OnPageCycledIn();
	void BP_OnNumPagesSet(int32 NumPages);
	void BP_OnIsInGameSet(bool bIsInGame);
	void BP_OnCyclePageOut(bool bForward);
	void BP_OnCyclePageIn(bool bForward);
};

// 0x10 (0x270 - 0x260)
// Class FortniteUI.AthenaChallengeProgressBar
class UAthenaChallengeProgressBar : public UUserWidget
{
public:
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Progress;                                 // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeProgressBar* GetDefaultObj();

	void SetPercentValueForMaterialNumber(int32 PercentValue);
};

// 0x68 (0x2F0 - 0x288)
// Class FortniteUI.AthenaChallengePunchCard
class UAthenaChallengePunchCard : public UCommonUserWidget
{
public:
	int32                                        MaxPunchesAllowed;                                 // 0x288(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_95E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      Box_PunchSlots;                                    // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Title;                                        // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Description;                                  // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_960[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bInitializedWidgetPool;                            // 0x2D8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bBundleIsKnown;                                    // 0x2D9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bBangShown;                                        // 0x2DA(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_964[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class UFortChallengeBundleItemDefinition> WeakBundleDef;                                     // 0x2DC(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_965[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             MostRecentPunch;                                   // 0x2E8(0x8)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengePunchCard* GetDefaultObj();

	void UpdateChallengePunchCard(class UFortChallengeBundleItem* Bundle, class UFortQuestItem* CopmpletedQuest);
	void UnfocusPunchCard();
	void TryToClearBangState();
	void ShowWidget();
	void SetUpEncodedName(const class FString& Name, int32 Count);
	void SetUnkownState(bool bKnown);
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle);
	void SetProgressCount(int32 AchivedCount, int32 GoalCount);
	void SetBangState(bool bShowBang);
	void HideProgressCount(bool bBundleCompleted);
	void FocusPunchCard();
	void FinishedPunchingCard(bool bPlayOutro);
};

// 0x40 (0x2C8 - 0x288)
// Class FortniteUI.AthenaChallengePunchCardEntry
class UAthenaChallengePunchCardEntry : public UCommonUserWidget
{
public:
	class FName                                  IconParamName;                                     // 0x288(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SlotIndex;                                         // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsBeingPlaced;                                    // 0x294(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_978[0x1B];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_RewardQuantity;                               // 0x2B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  Text_UnlockDate;                                   // 0x2B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_Stamp;                                   // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengePunchCardEntry* GetDefaultObj();

	void SetToDefaultSlot();
	void SetStyle(struct FFortChallengePunchCardStyles& PunchStyle);
	void SetIsNonsequentialSlot();
	void SetIsLastSlot();
	void SetIsFirstSlot();
	void OnPlacedEntry();
	void OnFinishedPlacingEntry();
};

// 0x60 (0x2E8 - 0x288)
// Class FortniteUI.AthenaChallengeRecapEntry
class UAthenaChallengeRecapEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_97C[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_QuestObjective;                               // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CompletionCount;                              // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Progression;                              // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeRecapEntry* GetDefaultObj();

	void UpdateProgressBar(float StartingPercent, float EndingPercent);
	void StartOutroAnim();
	void StartIntroAnim();
	void OutroFinished();
	void IntroFinished();
};

// 0x68 (0x2F0 - 0x288)
// Class FortniteUI.AthenaChallengeRewardTrackEntry
class UAthenaChallengeRewardTrackEntry : public UCommonUserWidget
{
public:
	class FName                                  MissionRewardParamName;                            // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UFortItemDefinition>    RewardToRepresent;                                 // 0x290(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BundleRewardIndex;                                 // 0x2B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_98C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_ConnectorLeft;                               // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ConnectorRight;                              // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeRewardDisplayEntry*    MissionReward;                                     // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_98F[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeRewardTrackEntry* GetDefaultObj();

	void StyleChange(bool bViewingPrestige);
	void SetToDefaultState();
	void SetLastNodeInTrack(bool bIsLast);
	void SetAsCurrentPreviewItem();
	void NextRewardToEarn(bool bNext);
	void CompletedNextNode(bool bAnimate);
	void CompletedCurrentNode(bool bAnimate, bool LastReward);
	void ClearPreviewSelection();
};

// 0x10 (0xBB0 - 0xBA0)
// Class FortniteUI.ChallengeScreenCategoryTab
class UChallengeScreenCategoryTab : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_TabName;                                      // 0xBA0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_994[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallengeScreenCategoryTab* GetDefaultObj();

};

// 0xD8 (0x530 - 0x458)
// Class FortniteUI.AthenaChallengeScreen
class UAthenaChallengeScreen : public UCommonActivatablePanel
{
public:
	TSubclassOf<class UAthenaChallengeSetBaseDetails> DefaultDetailsWidgetClass;                         // 0x458(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FDetailClassEntry>             DetailWidgestClasses;                              // 0x460(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   NextCategoryInputAction;                           // 0x470(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevCategoryInputAction;                           // 0x480(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<class UAthenaChallengeSetBaseDetails*> CreatedDetailWidgets;                              // 0x490(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetBaseDetails*        ActiveDetailsWidget;                               // 0x4A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTileBase*        LastSelectedTile;                                  // 0x4A8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_99F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButtonGroup*                    TabButtonGroup;                                    // 0x4B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9A0[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_SectionTabs;                              // 0x4F0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Sections;                                // 0x4F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_EventChallenges;                          // 0x500(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeScreenTile_Daily*      ChallengeTile_Dailies;                             // 0x508(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_WeeklyChallenges;                         // 0x510(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row1_MissionChallenges;                   // 0x518(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Row2_MissionChallenges;                   // 0x520(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_StyleChallenges;                          // 0x528(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreen* GetDefaultObj();

	bool ShouldPlayHolidayVideo();
	void OnHandleReplayHolidayVideo();
	bool IsPartyAssistedChallengeSet();
	void HandleTabSelectionChanged(class UCommonButton* TabButton, int32 TabIdx);
	void HandleTabClicked(class UCommonButton* TabButton, int32 TabIdx);
};

// 0x128 (0x5B8 - 0x490)
// Class FortniteUI.FortActivatablePanelWithItemPreview
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                        Pad_9AA[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemView*                         ItemViewObject;                                    // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x4A0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x4B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x4C0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x4D0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x4E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_9AB[0x94];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         AllowItemRotation;                                 // 0x584(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AllowItemZooming;                                  // 0x585(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         AutomaticallyRegisterCameraView;                   // 0x586(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         OverrideFixedCameras;                              // 0x587(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                            ActionDataTable;                                   // 0x588(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x590(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x598(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x599(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9AD[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x59C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9AF[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj();

	void ShowItemDetails();
	void OnVaultItemsViewed(TArray<class UFortItem*>& Items);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void HideItemDetails();
	class UWidget* GetWidgetForFramingViewedItem();
};

// 0x20 (0x5D8 - 0x5B8)
// Class FortniteUI.AthenaChallengeSetBaseDetails
class UAthenaChallengeSetBaseDetails : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                        Pad_9B1[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeSetBaseDetails* GetDefaultObj();

};

// 0x78 (0x650 - 0x5D8)
// Class FortniteUI.AthenaChallengeSetDetails
class UAthenaChallengeSetDetails : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_9B4[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x5F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x600(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x608(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                          VB_ChallengeExtensions;                            // 0x620(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaChallengeDetailBase*            ChallengeDetail_ListPanel;                         // 0x628(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              SB_MainContent;                                    // 0x630(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                   ItemInfo_PreviewedItem;                            // 0x638(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_PreviousSet;                                // 0x640(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                         Button_NextSet;                                    // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
};

// 0x70 (0x6C0 - 0x650)
// Class FortniteUI.AthenaChallengeSetDetails_Missions
class UAthenaChallengeSetDetails_Missions : public UAthenaChallengeSetDetails
{
public:
	int32                                        CurrentBundleItemLevel;                            // 0x650(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0x654(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0x65C(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9C6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   NextRewardInputAction;                             // 0x668(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   PrevRewardInputAction;                             // 0x678(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailRewardTrack*     ChallengeDetails_Rewards;                          // 0x688(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_LevelUpBundle;                              // 0x690(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_RewardUnlockTip;                              // 0x698(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              PrestiegeUpsell;                                   // 0x6A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_ProgressDisplay;                          // 0x6A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0x6B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_BundleState;                              // 0x6B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetDetails_Missions* GetDefaultObj();

	void VeiwingBundleLevelChanged();
	void UpdateLevelUpBundleButtonText();
	void OnBundlePrestiged();
	bool IsUrgentMission();
	bool IsGenericMission();
	bool IsCurrentlyViewPrestige();
	void HidePriestigeInfo(bool bHidePriestigeUpsell);
	TSoftObjectPtr<class UTexture2D> GetChaseRewardForBundleLevel(int32 BundleLevel);
	bool CanLevelBundle();
	bool BundleHasMultipleLevels();
};

// 0x80 (0x658 - 0x5D8)
// Class FortniteUI.AthenaChallengeSetImageGrid
class UAthenaChallengeSetImageGrid : public UAthenaChallengeSetBaseDetails
{
public:
	uint8                                        Pad_9C8[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ChallengeSetName;                             // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_Completion;                      // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0x620(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSwipePanel*                       SwipePanel_ChangeSet;                              // 0x628(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeListEntry_CompletionReward* CompletionReward_Entry;                            // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeSetListView*           ChallengeDetail_List;                              // 0x638(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeDetailImageGrid*       ChallengeDetail_ImageGrid;                         // 0x640(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PreviousSet;                                // 0x648(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_NextSet;                                    // 0x650(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetImageGrid* GetDefaultObj();

	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void ApplyNextSort();
};

// 0x58 (0x358 - 0x300)
// Class FortniteUI.AthenaChallengeSetListView
class UAthenaChallengeSetListView : public UAthenaChallengeListViewBase
{
public:
	struct FAthenaChallengeListVisualOptions     ListVisualOptions;                                 // 0x300(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bHideHeaders;                                      // 0x30C(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideCompletionRewards;                            // 0x30D(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHideQuestRewards;                                 // 0x30E(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCompactActionInfo;                             // 0x30F(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowFocus;                                       // 0x310(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9C9[0x2F];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeListEntry_Header> SectionHeaderEntryClass;                           // 0x340(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_CompletionReward> CompletionRewardEntryClass;                        // 0x348(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UAthenaChallengeListEntry_StoreOffer> SpecialOfferEntryClass;                            // 0x350(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetListView* GetDefaultObj();

};

// 0x18 (0xBB8 - 0xBA0)
// Class FortniteUI.AthenaChallengeScreenTileBase
class UAthenaChallengeScreenTileBase : public UCommonButton
{
public:
	class UCommonTextBlock*                      Text_ChallengeName;                                // 0xBA0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_RewardPreview;                           // 0xBA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9CE[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTileBase* GetDefaultObj();

	void ResetToLocked();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void OnChallengeSetEstablished(struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
};

// 0x8 (0x290 - 0x288)
// Class FortniteUI.AthenaMinimalChallengeInfoEntry
class UAthenaMinimalChallengeInfoEntry : public UCommonUserWidget
{
public:
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesComplete;              // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMinimalChallengeInfoEntry* GetDefaultObj();

	void OnChallengeInfoSet(bool bIsInProgress);
};

// 0x10 (0xBC8 - 0xBB8)
// Class FortniteUI.AthenaChallengeScreenTile_Daily
class UAthenaChallengeScreenTile_Daily : public UAthenaChallengeScreenTileBase
{
public:
	class UImage*                                Image_PartyAssist;                                 // 0xBB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_MinimalInfoDailies;                       // 0xBC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTile_Daily* GetDefaultObj();

};

// 0x8 (0xBC0 - 0xBB8)
// Class FortniteUI.AthenaChallengeScreenTile_PunchCard
class UAthenaChallengeScreenTile_PunchCard : public UAthenaChallengeScreenTileBase
{
public:
	class UAthenaPunchCard*                      PunchCard;                                         // 0xBB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeScreenTile_PunchCard* GetDefaultObj();

};

// 0x30 (0xBE8 - 0xBB8)
// Class FortniteUI.AthenaChallengeSetTile
class UAthenaChallengeSetTile : public UAthenaChallengeScreenTileBase
{
public:
	uint8                                        Pad_9D0[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaChallengeProgressBar*           ChallengeProgress_QuestsCompleted;                 // 0xBC8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_ChallengeContext;                             // 0xBD0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortLazyImage*                        LazyImage_CustomBackground;                        // 0xBD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                  RichText_UnavailableReason;                        // 0xBE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile* GetDefaultObj();

};

// 0x8 (0xBF0 - 0xBE8)
// Class FortniteUI.AthenaChallengeSetTile_Event
class UAthenaChallengeSetTile_Event : public UAthenaChallengeSetTile
{
public:
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xBE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Event* GetDefaultObj();

};

// 0x0 (0xBE8 - 0xBE8)
// Class FortniteUI.AthenaChallengeSetTile_Weekly
class UAthenaChallengeSetTile_Weekly : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Weekly* GetDefaultObj();

};

// 0x58 (0xC40 - 0xBE8)
// Class FortniteUI.AthenaChallengeSetTile_Mission
class UAthenaChallengeSetTile_Mission : public UAthenaChallengeSetTile
{
public:
	int32                                        BundleLevel;                                       // 0xBE8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BundleLevelCompletionPercent;                      // 0xBEC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PrestigeShimmerParamName;                          // 0xBF0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ContextColorParamName;                             // 0xBF8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9D2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_MissionCompleted;                            // 0xC08(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ChaseReward;                                 // 0xC10(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  Text_AvailableInTime;                              // 0xC18(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeCountdownDisplay*      Countdown_TimeRemaining;                           // 0xC20(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_LockReason;                               // 0xC28(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_MissionIcon;                              // 0xC30(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                       Switcher_Reward;                                   // 0xC38(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Mission* GetDefaultObj();

	bool IsUrgentMission();
	bool IsLockedByTime();
	bool IsGenericMission();
	TSoftObjectPtr<class UTexture2D> GetSoftTextureForChaseReward();
	bool CanLevelUpBundle();
};

// 0x0 (0xBE8 - 0xBE8)
// Class FortniteUI.AthenaChallengeSetTile_Style
class UAthenaChallengeSetTile_Style : public UAthenaChallengeSetTile
{
public:

	static class UClass* StaticClass();
	static class UAthenaChallengeSetTile_Style* GetDefaultObj();

};

// 0xA8 (0x370 - 0x2C8)
// Class FortniteUI.AthenaChallengesWidget
class UAthenaChallengesWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_9D7[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Challenges;                                   // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                      DynamicEntryBox_ChallengeEntries;                  // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9D8[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizedWidgetData;                             // 0x368(0x2)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_9D9[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengesWidget* GetDefaultObj();

	void HandleDisplayDynamicQuestUpdate(class UFortQuestObjectiveInfo* QuestObjective, bool DisplayStatusUpdate, bool DisplayAnnouncementUpdate);
	void BP_WidgetIsFinished();
	void BP_OnWidgetActivated();
};

// 0x80 (0x380 - 0x300)
// Class FortniteUI.AthenaChallengeTreeView
class UAthenaChallengeTreeView : public UAthenaChallengeListViewBase
{
public:
	uint8                                        Pad_9DA[0x70];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaChallengeTreeEntry_ChallengeSet> SetHeaderEntryClass;                               // 0x370(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReturnFocusToSelection;                           // 0x378(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9DB[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeTreeView* GetDefaultObj();

	void HandleQuestsUpdated();
};

// 0x60 (0x2C0 - 0x260)
// Class FortniteUI.AthenaChallengeWidget
class UAthenaChallengeWidget : public UUserWidget
{
public:
	class FText                                  RewardTextFormat;                                  // 0x260(0x18)(Edit, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_ChallengeDesc;                            // 0x278(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaChallengeProgressBar*           ChallengeProgress_ObjectivesCompleted;             // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URichTextBlock*                        RichText_RewardDesc;                               // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9DC[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaChallengeWidget* GetDefaultObj();

	void OnSetState(bool bIsCompleted, bool bIsLocked, bool bIsPartyAssisted, bool bIsGroupChallenge);
	void BP_OnIsLastEntrySet(bool bIsLastEntry);
	void BP_OnIsInGameSet(bool bIsInGame);
	void BP_OnChallengeInfoSet();
};

// 0xC8 (0x390 - 0x2C8)
// Class FortniteUI.AthenaCollectionItemToast
class UAthenaCollectionItemToast : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_9DE[0x68];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x330(0x2)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9DF[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToShowToast;                                   // 0x334(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        OpenCollectionScreenInputHoldTime;                 // 0x338(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ActivationDelay;                                   // 0x33C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemNumber;                                   // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLazyImage*                      LazyImage_ItemImage;                               // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                               Button_MobileClickCatcher;                         // 0x358(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9E0[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToast* GetDefaultObj();

	void HandleMobileClick();
	bool BPCallableIsDesignTime();
	void BP_OnToastUpdated(enum class EFortCollectedState CollectedState, int32 NumCollected);
	void BP_OnToastReset();
};

// 0x48 (0x3D8 - 0x390)
// Class FortniteUI.AthenaCollectionItemToastFishing
class UAthenaCollectionItemToastFishing : public UAthenaCollectionItemToast
{
public:
	class FText                                  LengthFormat;                                      // 0x390(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  LeaderLengthFormat;                                // 0x3A8(0x18)(Edit, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Length;                                   // 0x3C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_LeaderName;                                   // 0x3C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_LeaderLength;                             // 0x3D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionItemToastFishing* GetDefaultObj();

	void BP_OnUnlockedNewClue();
	void BP_OnStarRatingSet(int32 StarRating);
	void BP_OnRankSet(int32 Rank, int32 NumEntries);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0x38 (0x358 - 0x320)
// Class FortniteUI.AthenaCollectionLeaderboard
class UAthenaCollectionLeaderboard : public UCommonActivatableWidget
{
public:
	float                                        LeaderboardScrollSpeed;                            // 0x320(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LeaderboardScrollInitialDelay;                     // 0x324(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_Leaderboard;                             // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Leaderboard;                              // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9E6[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboard* GetDefaultObj();

};

// 0x60 (0x2E8 - 0x288)
// Class FortniteUI.AthenaCollectionLeaderboardEntry
class UAthenaCollectionLeaderboardEntry : public UCommonUserWidget
{
public:
	class FText                                  ValueTextFormat;                                   // 0x288(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  EmptyDisplayNameText;                              // 0x2A0(0x18)(Edit, NativeAccessSpecifierPrivate)
	int32                                        ValueMinimumFractionalDigits;                      // 0x2B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ValueMaximumFractionalDigits;                      // 0x2BC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bValueIsFloat;                                     // 0x2C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9EA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonTextBlock*                      Text_Placement;                                    // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Value;                                    // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_DisplayName;                                  // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                 AvatarIcon;                                        // 0x2E0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboardEntry* GetDefaultObj();

	void BP_OnValueSet(float Value);
	void BP_OnPlacementSet(int32 Placement);
	void BP_OnLeaderboardEntryReset();
	void BP_OnLeaderboardEntryInitialized(bool bIsLocalPlayer);
	void BP_OnDisplayNameSet(const class FString& DisplayName);
};

// 0x18 (0x300 - 0x2E8)
// Class FortniteUI.AthenaCollectionLeaderboardEntryFishing
class UAthenaCollectionLeaderboardEntryFishing : public UAthenaCollectionLeaderboardEntry
{
public:
	class FName                                  ParamName_Has2Stars;                               // 0x2E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has3Stars;                               // 0x2F0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Stars;                                       // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionLeaderboardEntryFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 StarRating);
};

// 0x38 (0x2C0 - 0x288)
// Class FortniteUI.AthenaCollectionListColumnEntry
class UAthenaCollectionListColumnEntry : public UCommonUserWidget
{
public:
	uint8                                        Pad_9EB[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicEntryBox*                      EntryBox_ListEntries;                              // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9EC[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListColumnEntry* GetDefaultObj();

};

// 0x38 (0xBD8 - 0xBA0)
// Class FortniteUI.AthenaCollectionListEntry
class UAthenaCollectionListEntry : public UCommonButton
{
public:
	uint8                                        Pad_9ED[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UImage*                                Image_Icon;                                        // 0xBB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_Number;                                       // 0xBB8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0xBC0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9EE[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListEntry* GetDefaultObj();

	void BP_OnEntryReset();
	void BP_OnEntryImageSet();
	void BP_OnEntryIconLoaded(class UObject* EntryIcon);
	void BP_OnCollectionStateSet(enum class EFortCollectedState CollectedState);
	void BP_OnCollectedByFriendSet(bool bCollectedByFriend);
};

// 0x28 (0xC00 - 0xBD8)
// Class FortniteUI.AthenaCollectionListEntryFishing
class UAthenaCollectionListEntryFishing : public UAthenaCollectionListEntry
{
public:
	class FName                                  ParamName_ItemIcon;                                // 0xBD8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_IsDiscovered;                            // 0xBE0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_ItemSize;                                // 0xBE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has2Stars;                               // 0xBF0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_Has3Stars;                               // 0xBF8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionListEntryFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 StarRating);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0x128 (0x340 - 0x218)
// Class FortniteUI.AthenaCollectionListView
class UAthenaCollectionListView : public UListViewBase
{
public:
	uint8                                        Pad_9F1[0xC0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        EntrySpacing;                                      // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumRows;                                           // 0x2DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9F2[0x60];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionListView* GetDefaultObj();

};

// 0x20 (0x2A8 - 0x288)
// Class FortniteUI.AthenaCollectionPlayerProgress
class UAthenaCollectionPlayerProgress : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                      Text_PlayerName;                                   // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Progress;                                     // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                 AvatarIcon;                                        // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9F4[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionPlayerProgress* GetDefaultObj();

	bool IsLocalPlayer();
	int32 GetNumCollected();
	void BP_OnShowPlayerInfoSet(bool bShowPlayerInfo);
	void BP_OnPlayerProgressInitialized(bool bIsLocalPlayer, int32 NumCollected, int32 NumToCollect);
};

// 0x40 (0x2C8 - 0x288)
// Class FortniteUI.AthenaCollectionPlayerProgressContainer
class UAthenaCollectionPlayerProgressContainer : public UCommonUserWidget
{
public:
	TSubclassOf<class UAthenaCollectionPlayerProgress> PlayerProgressClass;                               // 0x288(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CycleDelay;                                        // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ShowLocalPlayerAfterNumEntries;                    // 0x294(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaCollectionPlayerProgress*> CachedPlayerProgressEntries;                       // 0x298(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9F6[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionPlayerProgressContainer* GetDefaultObj();

	void BP_OnPlayerProgressEntriesCreated(TArray<class UAthenaCollectionPlayerProgress*>& PlayerProgressEntries, int32 NumToCollect);
	void BP_OnPlayerProgressContainerReset();
};

// 0x1C0 (0x4E0 - 0x320)
// Class FortniteUI.AthenaCollectionScreenBase
class UAthenaCollectionScreenBase : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_9F7[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CollectionName;                                    // 0x330(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FString                                CollectionType;                                    // 0x348(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                CollectionCategory;                                // 0x358(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  UnknownText;                                       // 0x368(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  UnknownDescription;                                // 0x380(0x18)(Edit, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                KnownEntryImage;                                   // 0x398(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                UnknownEntryImage;                                 // 0x3C0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                KnownOverlayImage;                                 // 0x3E8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UObject>                UnknownOverlayImage;                               // 0x410(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  PersonalBestTextFormat;                            // 0x438(0x18)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        PersonalBestMinimumFractionalDigits;               // 0x450(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        PersonalBestMaximumFractionalDigits;               // 0x451(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9F8[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAthenaCollectionScreenInfoOverlay> SoftInfoOverlayClass;                              // 0x458(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                            ScrollBox_List;                                    // 0x480(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionListView*             CollectionListView;                                // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UContentWidget*                        Content_InfoOverlayContainer;                      // 0x490(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionScreenInfoOverlay*    InfoOverlay;                                       // 0x498(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_ToggleInfoOverlay;                          // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Back;                                       // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionPlayerProgressContainer* PlayerProgressContainer;                           // 0x4B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWantsToShowInfoOverlay;                           // 0x4B8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bForceOverlayToggleMobile;                         // 0x4B9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_9F9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortCollectionsDataTable*             CollectionsDataTable;                              // 0x4C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCollectionData*                   CollectionData;                                    // 0x4C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9FA[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenBase* GetDefaultObj();

	void CenterSelectedEntry();
	void BP_OnStartedLoading();
	void BP_OnInfoOverlayDeactivated();
	void BP_OnInfoOverlayActivated();
	void BP_OnHandleSelectedEntryChanged(class UAthenaCollectionListEntry* SelectedEntry);
	void BP_OnFinishedLoading();
};

// 0x0 (0x4E0 - 0x4E0)
// Class FortniteUI.AthenaCollectionScreenCharacter
class UAthenaCollectionScreenCharacter : public UAthenaCollectionScreenBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenCharacter* GetDefaultObj();

};

// 0x18 (0x4F8 - 0x4E0)
// Class FortniteUI.AthenaCollectionScreenFishing
class UAthenaCollectionScreenFishing : public UAthenaCollectionScreenBase
{
public:
	class FText                                  RequiresProFishingRodText;                         // 0x4E0(0x18)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenFishing* GetDefaultObj();

};

// 0xC0 (0x3E0 - 0x320)
// Class FortniteUI.AthenaCollectionScreenInfoOverlay
class UAthenaCollectionScreenInfoOverlay : public UCommonActivatableWidget
{
public:
	uint8                                        Pad_A00[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonRichTextBlock*                  RichText_AdditionalInfo;                           // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_ItemImage;                                   // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  NumCollectedTextFormat;                            // 0x338(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FText                                  EmptyDisplayNameText;                              // 0x350(0x18)(Edit, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   ToggleLeaderboardRowHandle;                        // 0x368(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemType;                                     // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemName;                                     // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_AdditionalDescription;                    // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_FriendScores;                                // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_NumCollected;                             // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_ItemNumber;                                   // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Close;                                      // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortDynamicEntryBox*                  EntryBox_FriendScores;                             // 0x3B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCollectionLeaderboard*          FriendLeaderboard;                                 // 0x3C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A01[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenInfoOverlay* GetDefaultObj();

	void BP_OnShowLeaderboard();
	void BP_OnItemIconLoaded(class UObject* ItemIcon);
	void BP_OnInfoOverlayReset();
	void BP_OnHideLeaderboard();
	void BP_OnHasAdditionalInfoSet(bool bHasAdditionalInfo);
	void BP_OnFriendScoresUpdated(int32 NumFriendScores);
	void BP_OnFriendLeaderboardDeactivated();
	void BP_OnFriendLeaderboardActivated();
	void BP_OnCollectedStateSet(enum class EFortCollectedState CollectedState);
};

// 0x48 (0x428 - 0x3E0)
// Class FortniteUI.AthenaCollectionScreenInfoOverlayFishing
class UAthenaCollectionScreenInfoOverlayFishing : public UAthenaCollectionScreenInfoOverlay
{
public:
	bool                                         bNeedsProFishingRod;                               // 0x3E0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A04[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  NoneText;                                          // 0x3E8(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_ItemIcon;                                // 0x400(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  ParamName_IsDiscovered;                            // 0x408(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_PersonalBest;                             // 0x410(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MinSize;                                      // 0x418(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_MaxSize;                                      // 0x420(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCollectionScreenInfoOverlayFishing* GetDefaultObj();

	void BP_OnStarRatingSet(int32 NumStars);
	void BP_OnNormalizedLengthSet(float NormalizedLength, float NormalizedMinLength, float NormalizedMaxLength);
};

// 0x48 (0x310 - 0x2C8)
// Class FortniteUI.AthenaCommonPrioritizedWidget
class UAthenaCommonPrioritizedWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_A06[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAutoManagePriorityByVisibility;                   // 0x308(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x309(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_A07[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCommonPrioritizedWidget* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
};

// 0x360 (0x628 - 0x2C8)
// Class FortniteUI.AthenaCompassBase
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*              CompassMaterial;                                   // 0x2C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Image_Compass;                                     // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           MarkerBrush;                                       // 0x2D8(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           HeadingIndicatorBrush;                             // 0x360(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           StormIndicatorBrush;                               // 0x3E8(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MarkerVerticalOffset;                              // 0x470(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A09[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        HeadingFont;                                       // 0x478(0x50)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                           TeammateGunshotIndicatorBrush;                     // 0x4C8(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                           EnemyGunshotIndicatorBrush;                        // 0x550(0x88)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        TimeToShowGunshotIndicators;                       // 0x5D8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A0A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           GunshotIndicatorScaleOverTime;                     // 0x5E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorScaleByStrength;                   // 0x5E8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaOverTime;                     // 0x5F0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           GunshotIndicatorAlphaByHeading;                    // 0x5F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A0C[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCompassBase* GetDefaultObj();

};

// 0x50 (0x370 - 0x320)
// Class FortniteUI.AthenaConfirmationWindow
class UAthenaConfirmationWindow : public UCommonActivatableWidget
{
public:
	class UCommonTextBlock*                      Text_Title;                                        // 0x320(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_Description;                              // 0x328(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                        Image_MainIcon;                                    // 0x330(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                      EntryBox_Buttons;                                  // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBacchusCloseButton*                   Button_Close;                                      // 0x340(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonBorder*                         Border_TapToCloseZone;                             // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                   CancelAction;                                      // 0x350(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A10[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaConfirmationWindow* GetDefaultObj();

	void OnSetButtonText(class UCommonButton* Button, class FText& Text);
	struct FEventReply HandleTapToCloseZoneMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
};

// 0x1B8 (0x4B8 - 0x300)
// Class FortniteUI.AthenaMarkedActorIndicator
class UAthenaMarkedActorIndicator : public UFortActorIndicatorWidget
{
public:
	uint8                                        Pad_A12[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortWorldMarkerData                  MarkerData;                                        // 0x320(0x100)(Protected, NativeAccessSpecifierProtected)
	struct FMarkedActorDisplayInfo               MarkerDisplay;                                     // 0x420(0x68)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UFortMarkerDetailsTable*               DetailsTable;                                      // 0x488(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreshLargeItemShowTime;                            // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IndicatorDotSizeThreshold;                         // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       Switcher_IndicatorSize;                            // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_SmallIndicator;                              // 0x4A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_LargeIndicator;                              // 0x4A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_Distance;                                     // 0x4B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaMarkedActorIndicator* GetDefaultObj();

};

// 0x30 (0x4E8 - 0x4B8)
// Class FortniteUI.AthenaContextTutorialIndicator
class UAthenaContextTutorialIndicator : public UAthenaMarkedActorIndicator
{
public:
	float                                        OffscreenMaxTreshold;                              // 0x4B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A17[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              Overlay_Icon_1;                                    // 0x4C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A18[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ScreenEdgePaddingSizePercent;                      // 0x4CC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A19[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaContextTutorialIndicator* GetDefaultObj();

	void SwitchIndicatorSize();
	void SetScreenPercent(float Percent);
	void SetIndicatorText(class FText& Text);
	void PlayOutAnimation();
	void PlayInAnimation();
	void PlayBounceAnimation();
	float GetMinTreshold();
	float GetMaxTreshold();
	float GetMaxOffscreenTreshold();
	float GetCurrentDotProduct();
};

// 0x0 (0x370 - 0x370)
// Class FortniteUI.AthenaContextualChallengesWidget
class UAthenaContextualChallengesWidget : public UAthenaChallengesWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaContextualChallengesWidget* GetDefaultObj();

	bool ShouldOutroAutomatically();
	void OnResetOutroDelay();
	void OnNewContextualHeader(class FText& NewText);
	void HandleToggleFullscreenMap(bool bFullscreenMapVisible);
	void HandleNewContextualObjectives(TArray<class UFortQuestItem*>& InContextualQuests);
	float GetOutroDelay();
};

// 0x60 (0x2E8 - 0x288)
// Class FortniteUI.AthenaCosmeticUnlockingInfo
class UAthenaCosmeticUnlockingInfo : public UCommonUserWidget
{
public:
	class UCommonRichTextBlock*                  RichText_StaticUnlockingText;                      // 0x288(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_UnlockingText;                            // 0x290(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                          ProgressBar_StepsCompleted;                        // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                  RichText_ProgressCompletion;                       // 0x2A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                EmphasisStyle;                                     // 0x2A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ProgressCompletionNumericStyle;                    // 0x2B8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticItemDefinition*         CosmeticItemDef;                                   // 0x2C8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A1F[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCosmeticUnlockingInfo* GetDefaultObj();

	void ShowUnlockingInfoForCosmeticVariant(class UAthenaCosmeticItemDefinition* InCosmeticItemDef, struct FGameplayTag& InVariantChannel, struct FGameplayTag& InVariant);
	void ShowUnlockingInfoForCosmetic(class UAthenaCosmeticItemDefinition* InCosmeticItemDef);
	void ShowUnlockingInfo(class UAthenaCosmeticItemDefinition* UnlockItem, class UFortItemDefinition* UnlockSource);
	void ShowSeasonUnlockingInfo(int32 SeasonNumber, int32 TierNumber);
	void RequestUpdateAnim();
	void RequestOutroAnim();
	void RequestIntroAnim();
	void OutroAnimFinished();
	void OnUnlockingInfoSet(bool bShowProgression);
	void HideUnlockingInfo();
};

// 0x48 (0x310 - 0x2C8)
// Class FortniteUI.AthenaCountdownWidgetBase
class UAthenaCountdownWidgetBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_A23[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x308(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_A24[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCountdownWidgetBase* GetDefaultObj();

	void OnDisplayWarningMessage(class FText& FirstLineText, class FText& SecondLineText);
	void OnCountdownUpdate(int32 TimeRemaining, class FText& CountdownUpdateText);
	void OnCountdownStopped();
	void OnCountdownStarted(int32 TimeRemaining, class FText& CountdownIntroText);
	void OnCountdownFinished();
	void HandleGamePhaseStepChanged(TScriptInterface<class IFortSafeZoneInterface>& SafeZoneInterface, enum class EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int32 TimeRemaining);
	void HandleCountdownStopped();
	void HandleCountdownStarted(int32 TimeRemaining);
	void HandleCountdownFinished();
};

// 0x180 (0x1A8 - 0x28)
// Class FortniteUI.AthenaCreativeItemEntryObjectWrapper
class UAthenaCreativeItemEntryObjectWrapper : public UObject
{
public:
	struct FFortItemEntry                        ItemEntry;                                         // 0x28(0x180)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemEntryObjectWrapper* GetDefaultObj();

};

// 0x198 (0xD38 - 0xBA0)
// Class FortniteUI.AthenaCreativeItemTileButton
class UAthenaCreativeItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_A26[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCreativeItemTileView*           ParentView;                                        // 0xBA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemDefinition*                   ItemDefinition;                                    // 0xBB0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortItemEntry                        ItemEntry;                                         // 0xBB8(0x180)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileButton* GetDefaultObj();

	void OnLoadedItem();
	void OnEntryClick(class UAthenaCreativeItemTileButton* Entry);
	class UAthenaCreativeItemEntryObjectWrapper* MakeFortItemEntryObjectWrapper(class UObject* Target, struct FFortItemEntry& InItemEntry);
	int32 GetItemTypeCount();
	bool CompareToItemEntry(struct FFortItemEntry& InItemEntry);
};

// 0x18 (0x3A0 - 0x388)
// Class FortniteUI.AthenaCreativeItemTileView
class UAthenaCreativeItemTileView : public UCommonTileView
{
public:
	class UFortOptionsTab*                       ParentTab;                                         // 0x388(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             CurrentlyFocusedItem;                              // 0x390(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A27[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCreativeItemTileView* GetDefaultObj();

};

// 0x40 (0x308 - 0x2C8)
// Class FortniteUI.AthenaCurieStatusWidget
class UAthenaCurieStatusWidget : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_A2B[0x40];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaCurieStatusWidget* GetDefaultObj();

	void SetPlayerState(class AFortPlayerStateAthena* PlayerState);
	void OnPlayerStatePawnChanged();
	void OnCurieStateRemoved(struct FGameplayTag& RemovedState);
	void OnCurieStateAdded(struct FGameplayTag& AddedState);
	bool HasState(const struct FGameplayTag& CurieState);
};

// 0xD0 (0x358 - 0x288)
// Class FortniteUI.FortItemPickerBase
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	FMulticastInlineDelegateProperty_            OnSelectionChangedEvent;                           // 0x288(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSelectionCommittedEvent;                         // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemClicked;                                     // 0x2A8(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemClickedDoubleClicked;                        // 0x2B8(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemHoveredEvent;                                // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemUnhovered;                                   // 0x2D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                     PickerTileView;                                    // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UListView*                             ItemListViewWidget;                                // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A32[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x308(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A33[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               NewlySelectedItem;                                 // 0x310(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x318(0x10)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A34[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFortItemPickerBase* GetDefaultObj();

	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int32 Index);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	bool IsNullItemExplicitlySelected();
	class UFortItem* GetSelectedItem();
	TScriptInterface<class IFortItemListViewInterface> GetListViewInterface();
	int32 GetIndexForItem(class UFortItem* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};

// 0xB0 (0x408 - 0x358)
// Class FortniteUI.AthenaCustomizationPicker
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaving;                         // 0x358(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCosmeticSelectionSaved;                          // 0x368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnShowSaveButton;                                  // 0x378(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnHideSaveButton;                                  // 0x388(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonButton>             FilterTabButtonType;                               // 0x398(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCommonButtonStyle>        FilterTabButtonStyle;                              // 0x3A0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FFortAthenaItemManagementInventoryFilterTabLabelInfo> FilterTabLabelInfoArray;                           // 0x3A8(0x10)(Edit, EditFixedSize, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortTabListWidgetBase*                FilterTabList;                                     // 0x3B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  CurrentFilterName;                                 // 0x3C0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A39[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAthenaCustomizationCategory      CustomizeCategory;                                 // 0x3D8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A3A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0x3DC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowUnownedItems;                                // 0x3E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowCommits;                                     // 0x3E1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOneItemPerSlot;                                   // 0x3E2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A3B[0x15];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             ItemListeningTo;                                   // 0x3F8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCosmeticAccountItem*            LocalCampaignHeroItem;                             // 0x400(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPicker* GetDefaultObj();

	void SetFilter(class FName FilterName);
	void SearchText(class FText& Text);
	void RefreshView(bool CategoryChanging, bool FilterChanged, bool bSearchTextChanged);
	void OnUpdateSaveButtonVisuals__DelegateSignature();
	void OnSearchEnabled(bool bEnabled);
	void OnNoItemsAvailableInFilter(class FText& EmptyDisplayText);
	void OnItemsAvailableInFilter();
	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void HandleSelectedItemHasChanged(bool ItemChanged, bool AmmoChanged, bool IngredientsChanged);
	void HandleFilterTabSelected(class FName TabNameID);
	void HandleFilterTabButtonCreated(class FName TabNameID, class UCommonButton* TabButton);
	void HandleDifferentFilterSetBP();
	class FText GetQualifiedFilterDisplayName(enum class EAthenaFilterDisplayType InTopFilterDisplaySetting);
	void EndCustomizationCategory();
	void BeginCustomizationCategory(enum class EAthenaCustomizationCategory Category, int32 SubslotToEdit, bool bInAllowUnownedItems, bool bInOneItemPerSlot);
};

// 0x20 (0xBC0 - 0xBA0)
// Class FortniteUI.FortCosmeticItemTileButton
class UFortCosmeticItemTileButton : public UCommonButton
{
public:
	uint8                                        Pad_A3E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0xBA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>              Item;                                              // 0xBB0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ItemCardWidth;                                     // 0xBB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MobileScalingFactor;                               // 0xBBC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortCosmeticItemTileButton* GetDefaultObj();

};

// 0x20 (0xBE0 - 0xBC0)
// Class FortniteUI.AthenaCustomizationPickerTileButton
class UAthenaCustomizationPickerTileButton : public UFortCosmeticItemTileButton
{
public:
	uint8                                        Pad_A3F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortBangWrapper_NUI*                  Bang;                                              // 0xBC8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0xBD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0xBD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj();

	void OnEquippedStateChanged(bool bEquipped, bool bOnDifferentSlot);
	void OnChangeOwnedState(bool bOwned);
};

// 0xE0 (0x570 - 0x490)
// Class FortniteUI.FortItemPreviewScreen
class UFortItemPreviewScreen : public UFortActivatablePanel
{
public:
	uint8                                        Pad_A40[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   ItemViewUnifiedSupportsCameraControlInputAction;   // 0x4A0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewUnifiedZoomInputAction;                    // 0x4B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomOutInputAction;                        // 0x4C0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewZoomInInputAction;                         // 0x4D0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   ItemViewRotateInputAction;                         // 0x4E0(0x10)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      AnimationToHideItemInfo;                           // 0x4F0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoShowDetails;                                  // 0x4F8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bItemDetailsHidden;                                // 0x4F9(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A41[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HideItemInfoHeaderDurationSecs;                    // 0x4FC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A42[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         AllowItemRotation;                                 // 0x508(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AllowItemZooming;                                  // 0x509(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EFrontEndCamera                   FrontEndCamera;                                    // 0x50A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A43[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          PreviewSceneChangerTag;                            // 0x50C(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A44[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortItemPreviewSceneChanger*          PreviewSceneChanger;                               // 0x518(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortItemView*                         ItemViewObject;                                    // 0x520(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemRotation;                                // 0x528(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowItemZooming;                                 // 0x529(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A45[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CameraEntryTransitionDuration;                     // 0x52C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCurveFloat*                           CameraEntryTransitionCurve;                        // 0x530(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A46[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               Widget_CameraFrame;                                // 0x560(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_PreviewAction;                              // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFortItemPreviewScreen* GetDefaultObj();

	void ShowItemDetails();
	void OnPreviewActionButtonUpdated(class FText& RowDisplayName);
	void HideItemDetails();
};

// 0x4D0 (0xA40 - 0x570)
// Class FortniteUI.AthenaCustomizationScreen
class UAthenaCustomizationScreen : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x570(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A4D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x578(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      InitialCustomizationCategory;                      // 0x5C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A4E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CategoryDisplayNames[0x16];                        // 0x5C8(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x16];                        // 0x7D8(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A4F[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xA00(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaItemSelectorScreenBase*         ItemSelectorScreen;                                // 0xA08(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A50[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xA18(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xA28(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xA30(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          LoadoutSelector;                                   // 0xA38(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreen* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void OnLoadoutChanged();
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0x6A8 (0xC18 - 0x570)
// Class FortniteUI.AthenaCustomizationScreenBase
class UAthenaCustomizationScreenBase : public UFortItemPreviewScreen
{
public:
	bool                                         bCustomizationSelectionBeingProcessed;             // 0x570(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A5F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAthenaCustomizationParams            CustomizationParams;                               // 0x578(0x48)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      FirstCustomizationCategory;                        // 0x5C0(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A60[0x10F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CategoryDisplayNames[0x16];                        // 0x6D0(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	class FText                                  ItemTypeDisplayNames[0x16];                        // 0x8E0(0x210)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A61[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAthenaItemSelectorScreenBase> ItemSelectorScreenClass;                           // 0xB20(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortActivatablePanel>     LoadoutSelectorScreenClass;                        // 0xB28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortBannerSelectModal>    BannerSelectModalClass;                            // 0xB30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortNameLoadoutPopup>     NameLoadoutPopupClass;                             // 0xB38(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortProgressModal>        ProgressModalClass;                                // 0xB40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortProgressModal*                    ProgressModalInstance;                             // 0xB48(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A62[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaCustomizationSlotSelectorButton* LastHoveredSlot;                                   // 0xB58(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A63[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   OpenNameLoadoutInputAction;                        // 0xB68(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<enum class EAthenaCustomizationCategory> BuiltInEmoteCategoryPriorities;                    // 0xB78(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDisplayBuiltInEmotesInEmoteRow;                   // 0xB88(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A64[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidgetAnimation*                      BoundAnim_Intro;                                   // 0xB90(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                      BoundAnim_Outro;                                   // 0xB98(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidget*                               Container_Loadouts_GodTileArea;                    // 0xBA0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_Loadouts;                                   // 0xBA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_SavePreset;                                 // 0xBB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_RandomPresets;                              // 0xBB8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutSelector*          Loadout_Selector;                                  // 0xBC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortCosmeticLoadoutCard*              LoadoutCard_AppliedAnimation;                      // 0xBC8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_GearSlotRow;                                 // 0xBD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Glider;                                       // 0xBD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_Contrail;                                     // 0xBE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaCustomizationSlotSelectorButton* Slot_LoadingScreen;                                // 0xBE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_EmoteSlotRow;                                // 0xBF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_WrapSlotRow;                                 // 0xBF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPanelWidget*                          Panel_AccountSlotRow;                              // 0xC00(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBannerSlotButton*                 Banner_Button;                                     // 0xC08(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaLockerItemInfo*                 ItemInfo_Display;                                  // 0xC10(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationScreenBase* GetDefaultObj();

	void ShowLockerSlot(enum class EAthenaCustomizationCategory CustomizationCategory, int32 SlotIndex, bool bCanShowEmpty);
	bool ShouldDisplayNextRandomPresetName();
	void ShiftItemsVariantOption(class UAthenaCosmeticAccountItem* Item, int32 VariantChannelIndex);
	void SetCustomizationSelectionBeingProcessed(bool bIsBeingProcessed);
	void OnRefreshForNewLoadout(const class FString& LoadoutName, bool bIsShuffleTile);
	void OnPlayerToggledRandomPresets(bool bNowEnabled);
	void OnIntroAppliedPreset();
	void OnBeginSavingLoadouts();
	void OnBeginPickingLoadouts();
	void OnBeginPickingCustomizationSlot(class UAthenaCustomizationSlotSelectorButton* SlotButton);
	void HandleInventoryUpdated(TSet<class FString>& ItemChangeFlags, int64 ProfileRevision);
	class FText GetItemTypeDisplayNames(enum class EAthenaCustomizationCategory InCategory);
	class UFortItem* GetFavoriteItemForCategory(enum class EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);
	class FText GetCategoryDisplayName(enum class EAthenaCustomizationCategory InCategory);
};

// 0xC8 (0xC68 - 0xBA0)
// Class FortniteUI.AthenaCustomizationSlotSelectorButton
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	class FText                                  CategoryDisplayName;                               // 0xBA0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  CategoryDescription;                               // 0xBB8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	enum class EAthenaCustomizationCategory      CustomizationType;                                 // 0xBD0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A6C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SubslotIndex;                                      // 0xBD4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EFortBangType                     BangType;                                          // 0xBD8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowUnownedItems;                                // 0xBD9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneItemPerSlot;                                   // 0xBDA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A6D[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     OverrideSlotImage;                                 // 0xBE0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCosmeticItemCard*                 ItemWidget;                                        // 0xBE8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          RequiredSlotGameplayTag;                           // 0xBF0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             DefaultEmptyTexture;                               // 0xBF8(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CardWidth;                                         // 0xC20(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A6E[0x24];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             LocalCampaignHeroPartItem;                         // 0xC48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_Favorite;                                    // 0xC50(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                Image_ClassIcon;                                   // 0xC58(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortBangWrapper_NUI*                  Bang_Wrapper;                                      // 0xC60(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj();

	void SetCustomizationType(enum class EAthenaCustomizationCategory NewType, int32 InSubslotIndex, struct FGameplayTag& RequiredSlotTag);
	void SetCardDefaultImageAndWidth(TSoftObjectPtr<class UTexture2D>& InDefaultImage, float InWidth);
	void OnUpdateExclusiveWarning(bool bShouldWarn);
	void OnCustomizationSlotActiveStateChanged(bool bInAttachableCosmeticAvailable, bool bInActive);
	void OnCardImageAndWidthChanged(TSoftObjectPtr<class UTexture2D>& Image, float Width);
	bool IsSlotFilled();
	void HandleDifferentHeroLoadoutActivated(class UFortMcpProfileCampaign* Profile);
	void GetCustomizationSlotActiveState(bool* bOutAttachableCosmeticAvailable, bool* bOutActive);
	class UFortItem* GetCampaignHeroPartItem();
};

// 0x58 (0x320 - 0x2C8)
// Class FortniteUI.AthenaDiscoverabilityBase
class UAthenaDiscoverabilityBase : public UFortHUDElementWidget
{
public:
	uint8                                        Pad_A6F[0x48];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortPrioritizedWidgetData            PrioritizationData;                                // 0x310(0x2)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_A70[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortControllerComponent_MapDiscoverability* AssociatedComponent;                               // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAthenaDiscoverabilityBase* GetDefaultObj();

	void OnStompFailed();
	void OnStompedByOtherWidget();
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	void CommonArrivalEvent(struct FGameplayTag& NewTag);
};

// 0x0 (0x320 - 0x320)
// Class FortniteUI.AthenaDiscoveredAreaOverlay
class UAthenaDiscoveredAreaOverlay : public UAthenaDiscoverabilityBase
{
public:

	static class UClass* StaticClass();
	static class UAthenaDiscoveredAreaOverlay* GetDefaultObj();

	void OnNewDiscovery(class FText& LocalizedLocationName, bool bIsNamedLocation);
};

// 0x50 (0xBF0 - 0xBA0)
// Class FortniteUI.AthenaMtxOfferButtonBase
class UAthenaMtxOfferButtonBase : public UCommonButton
{
public:
	uint8                                        Pad_A75[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortStoreFrontOfferInfo*              OfferData;                                         // 0xBA8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_MtxAmount;                                    // 0xBB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_RealMoneyPrice;                               // 0xBB8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonVisibilitySwitcher*             OptionalSwitcher_CurrencyIcons;                    // 0xBC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                OptionalIMG_StarterKit;                            // 0xBC8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLoadGuard*                      LoadGuardCurrencySpinner;                          // 0xBD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A76[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaMtxOfferButtonBase* GetDefaultObj();

	void HandleMtxPurchaseComplete(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems);
};

// 0x8 (0xBF8 - 0xBF0)
// Class FortniteUI.AthenaDynamicMtxOfferButton
class UAthenaDynamicMtxOfferButton : public UAthenaMtxOfferButtonBase
{
public:
	class UCommonTextBlock*                      Text_DynamicMtxAmount;                             // 0xBF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaDynamicMtxOfferButton* GetDefaultObj();

};

// 0x58 (0x610 - 0x5B8)
// Class FortniteUI.AthenaReloadMtxScreenBase
class UAthenaReloadMtxScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	uint8                                        Pad_A7A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortStoreFrontOfferInfo*              OfferInfo;                                         // 0x5C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                      Text_AmountNeeded;                                 // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_A7B[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BackAction;                                        // 0x5F0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_MobileClose;                                // 0x600(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaSmallOfferPreviewBase*          SmallOfferPreview_Widget;                          // 0x608(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAthenaReloadMtxScreenBase* GetDefaultObj();

	void HandleBackButton(bool* bPassThrough);
};

// 0x70 (0x680 - 0x610)
// Class FortniteUI.AthenaDynamicReloadMtxScreen
class UAthenaDynamicReloadMtxScreen : public UAthenaReloadMtxScreenBase
{
public:
	class UCommonTextBlock*                      Text_TotalNeeded;                                  // 0x610(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                      Text_CurrentBalance;                               // 0x618(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonVisibilitySwitcher*             Switcher_DynamicOptions;                           // 0x620(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaStarterKitOfferButton*          Button_StarterKitOption;                           // 0x628(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_MtxRequired;                               // 0x630(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                              Overlay_StarterKit;                                // 0x638(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaDynamicMtxOfferButton*          Button_MtxRequiredOption;                          // 0x640(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaStaticMtxOfferButton*           Button_MtxOtherOption;                             // 0x648(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         Button_MoreOptions;                                // 0x650(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                          StorefrontNames;                                   // 0x658(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAthenaReloadMtxScreen*                StaticReloadMtxScreen;                             // 0x668(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                         MtxRequiredButtonToFocus;                          // 0x670(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A7D[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaDynamicReloadMtxScreen* GetDefaultObj();

	class UWidget* GetMtxRequiredButtonToFocus(enum class EUINavigation InNavigation);
};

// 0x8 (0x4C0 - 0x4B8)
// Class FortniteUI.AthenaEliminationIndicator
class UAthenaEliminationIndicator : public UAthenaMarkedActorIndicator
{
public:
	uint8                                        Pad_A7E[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAthenaEliminationIndicator* GetDefaultObj();

};

// 0x0 (0x260 - 0x260)
// Class FortniteUI.AthenaEliminationOverlayBase
class UAthenaEliminationOverlayBase : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAthenaEliminationOverlayBase* GetDefaultObj();

};

// 0x0 (0x288 - 0x288)
// Class FortniteUI.AthenaEndGamePlacementWidget
