#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x280 (0x280 - 0x0)
// UserDefinedStruct FortUIStylesheet.FortUIStylesheet
struct FFortUIStylesheet
{
public:
	struct FFortUITheme                          ThemeMinusDefault_91_015CB18F413B4A467B38CB93E8734A68; // 0x0(0x60)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUITheme                          ThemeMinusEmphasis_94_962F11A944E9DF11F547FBBDB98DD4BE; // 0x60(0x60)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUITheme                          ThemeMinusCritical_97_43F63D0C4E71395016AE00B41BB7BA0C; // 0xC0(0x60)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusBuff_145_AC063FB242D9ECBD0B6306BBE205C7F7; // 0x120(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusDebuff_146_0402338944FCC3DED4C90E9A78FD8BC5; // 0x130(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusUnique_150_B15CF0C9436988001F70B4B8F9D32E5B; // 0x140(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusFireElemental_152_FBAFDA0C445A96F1B689E880A707069C; // 0x150(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusIceElemental_154_FDA209D8429DF768ABA53EBA24C4B505; // 0x160(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusBoltElemental_156_10AEFEC147C25B2DEE47619E4AB4ABC7; // 0x170(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ColorMinusHarvestWeakPoint_159_AE0CF44C4731DAF69193D4B4E59B0E7E; // 0x180(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EFortBrushSize, struct FVector2D> StandardMinusIconMinusSize_174_E90B59CC4EF046AEDF28A0BA360D7D71; // 0x190(0x50)(Edit, BlueprintVisible)
	TMap<enum class EFortBrushSize, struct FVector2D> ItemMinusSize_173_B43931B34EEE416F836301A3A3573E09; // 0x1E0(0x50)(Edit, BlueprintVisible)
	TMap<enum class EFortBrushSize, struct FVector2D> ItemMinusIconMinusSize_172_93F895F043E3487E9AF205B72C3EF84B; // 0x230(0x50)(Edit, BlueprintVisible)
};

}


