#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x19F5 (0x1D05 - 0x310)
// AnimBlueprintGeneratedClass HeldObjectLayerAnimBP.HeldObjectLayerAnimBP_C
class UHeldObjectLayerAnimBP_C : public UFortItemLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x310(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData            AnimBlueprintClassSubsystem_PropertyAccess;        // 0x318(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6968[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Root                        AnimGraphNode_Root_34;                             // 0x320(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x350(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_33;                             // 0x3D8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x408(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_32;                             // 0x490(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x4C0(0x88)(None)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0x548(0x188)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x6D0(0x88)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x758(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x820(0x28)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_31;                             // 0x848(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x878(0x88)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x900(0x78)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x978(0xA0)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_30;                             // 0xA18(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0xA48(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_29;                             // 0xAD0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0xB00(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_28;                             // 0xB88(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_27;                             // 0xBB8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_26;                             // 0xBE8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0xC18(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_25;                             // 0xC90(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0xCC0(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_24;                             // 0xD38(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0xD68(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_23;                             // 0xDE0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0xE10(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_22;                             // 0xE88(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0xEB8(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_21;                             // 0xF30(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0xF60(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_20;                             // 0xFD8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x1008(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_19;                             // 0x1080(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_18;                             // 0x10B0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_17;                             // 0x10E0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0x1110(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_16;                             // 0x1198(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0x11C8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_15;                             // 0x1250(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0x1280(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_14;                             // 0x1308(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0x1338(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_13;                             // 0x13C0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0x13F0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_12;                             // 0x1478(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0x14A8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0x1530(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0x1560(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0x15E8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x1618(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0x16A0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x16D0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0x1758(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x1788(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x1810(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x1840(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x18C8(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x18F8(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x1970(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x19A0(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x1A18(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x1A48(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x1AC0(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x1AF0(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x1B68(0x30)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x1B98(0x78)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x1C10(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x1C40(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x1CC8(0x30)(None)
	float                                        Pitch;                                             // 0x1CF8(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Yaw;                                               // 0x1CFC(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AimOffsetAlpha;                                    // 0x1D00(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsHeldObjectDropped;                               // 0x1D04(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UHeldObjectLayerAnimBP_C* GetDefaultObj();

	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void AnimNotify_HeldObjectPlace();
	void AnimNotify_HeldObjectPickUp();
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_HeldObjectLayerAnimBP(int32 EntryPoint);
};

}


