#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1248 (0x1538 - 0x2F0)
// AnimBlueprintGeneratedClass HighTower_Tapas_LayerAnimBP.HighTower_Tapas_LayerAnimBP_C
class UHighTower_Tapas_LayerAnimBP_C : public UFortItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2F0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData            AnimBlueprintClassSubsystem_PropertyAccess;        // 0x2F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_76CB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Root                        AnimGraphNode_Root_34;                             // 0x300(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x330(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_33;                             // 0x3B8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x3E8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_32;                             // 0x470(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x4A0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_31;                             // 0x528(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_30;                             // 0x558(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_29;                             // 0x588(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_28;                             // 0x5B8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_27;                             // 0x5E8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_26;                             // 0x618(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_25;                             // 0x648(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_24;                             // 0x678(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_23;                             // 0x6A8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_22;                             // 0x6D8(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_21;                             // 0x708(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_20;                             // 0x738(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x768(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_19;                             // 0x7F0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x820(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_18;                             // 0x8A8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0x8D8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_17;                             // 0x960(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0x990(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_16;                             // 0xA18(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0xA48(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_15;                             // 0xAD0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0xB00(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_14;                             // 0xB88(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0xBB8(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_13;                             // 0xC40(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0xC70(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_12;                             // 0xCF8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0xD28(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0xDB0(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0xDE0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0xE68(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0xE98(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0xF20(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0xF50(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0xF80(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0xFB0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0xFE0(0x30)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x1010(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x1040(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x10C8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x10F8(0x88)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x1180(0x88)(None)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace;            // 0x1208(0x188)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0x1390(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x13C0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x1448(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x1478(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x1500(0x30)(None)
	float                                        Pitch;                                             // 0x1530(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Yaw;                                               // 0x1534(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UHighTower_Tapas_LayerAnimBP_C* GetDefaultObj();

	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_HighTower_Tapas_LayerAnimBP(int32 EntryPoint);
};

}


