#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA8 (0xA8 - 0x0)
// UserDefinedStruct PetOffsets.PetOffsets
struct FPetOffsets
{
public:
	struct FVector                               DefaultIdle_8_8892313945CCFA46DC1B578F9DB171F7;    // 0x0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DefaultDownsights_14_C2C2A0EB43805A8B609F97AFB55671AC; // 0xC(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CrouchIdle_13_5A29765C4C510A66E07EB8ACF83E7624;    // 0x18(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CrouchDownsights_15_84A405F2481E099CC6244FACEBE95798; // 0x24(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DBNOIdle_9_403AAC1C4768B12705B411AE4355C781;       // 0x30(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               MeleePlaying_17_10528014442D5D9E88CE2D90BDE272C9;  // 0x3C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               EmotePlaying_19_1EDED59548388388820CA5B24B042C23;  // 0x48(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DefaultSkydive_22_3D3DFA9A45555A94A76EDD91BC6DAEA3; // 0x54(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SurfaceSwimmingIdle_26_2552B8D249E4C3542D7E8FA698634F21; // 0x60(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SurfaceSwimmingDownsights_28_A2255FFB4B7708C64ACE40870DBAE5B0; // 0x6C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SurfaceSwimmingMeleePlaying_32_3DCA70F44B63CBC23D5C90B048EE6728; // 0x78(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DiveJumping_35_543367DC490E9F23971633AB6E81FC8D;   // 0x84(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CrouchTurning_44_87463B814E1853818F5652888EEAD4CE; // 0x90(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               DivingSkydive_48_7B14AA6E432CABE53A3D96A849903740; // 0x9C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


